[
    {
        "chapter_title": "EINLEITUNG",
        "chapter_content": "Vielen Dank für Ihr Interesse am NADOO System.\nIn diesem Buch möchte ich Ihnen meine Gedanken und Ideen zum Nadoo-System präsentieren, die sich über mehr als einem Jahrzehnt hinweg entwickelt haben. Ich habe dieses Buch verfasst, um meine Gedanken zu ordnen, aber auch, um sie mit Menschen wie Ihnen, die an der Vision hinter dem System interessiert sind, zu teilen.\nDas System befindet sich in ständiger Entwicklung, und um die neueste Version dieses Buches zu erhalten, können Sie sich gerne per E-Mail an christoph.backhaus@NADOOIT.de mit dem Betreff \"NADOO System Update Me\" wenden. Durch die Anmeldung stimmen Sie zu, E-Mails im Zusammenhang mit dem NADOO System zu erhalten."
    },
    {
        "chapter_title": "WAS ERWARTET SIE?",
        "chapter_content": "In diesem Buch werden die verschiedenen Teile des Systems behandelt, wobei jedes Kapitel auf einen spezifischen Bereich eingeht. Da alle Teile des Systems aufeinander aufbauen, werden sie auch in anderen Kapiteln erwähnt. Die Abschnitte sollen dazu beitragen, die einzelnen Aspekte des Systems zu vertiefen und offene Fragen zu klären.\nJedes Kapitel ist als Antwort auf eine spezifische Frage strukturiert, die im Titel angegeben ist. Wenn Sie im Inhaltsverzeichnis eine Frage finden, die Sie selbst zu NADOO haben, können Sie direkt zu der entsprechenden Antwort springen.\nIn den folgenden Kapiteln werde ich die Zielgruppen von NADOO vorstellen, mich vorstellen und eine Zusammenfassung aus den bisherigen Entwicklungen seit der Veröffentlichung NADOO’s geben. Durch den Hintergrund zu meiner Person wird es Ihnen leichter fallen, die Perspektive zu verstehen, die zur Entstehung von NADOO geführt hat. Auch können Sie, wenn Sie dieses Kapitel lesen in etwa einschätzen wie weit NADOO bereits ist.\nIm Kapitel \"WIESO ICH DAS NADOO-SYSTEM ENTWICKELT HABE\" werde ich meine Beweggründe erklären, die zur Entwicklung von NADOO geführt haben. Dies soll dabei helfen, meine Herangehensweise und die Gründe zu verstehen, warum manche Bausteine den Eindruck vermitteln könnten, \"zu gut, um wahr zu sein\".\nAlle darauffolgenden Kapitel beschäftigen sich mit den verschiedenen Komponenten des Systems. Dabei werden auch Beispiele und Fallstudien eingebunden, um die Konzepte zu verdeutlichen und verständlicher zu machen.\nDas Buch endet damit, wie ich mir die Veränderungen vorstelle, die NADOO bewirken kann, und wie es die Gesamtwirtschaft erweitern kann. Dabei werden auch praktische Anwendungen und mögliche Auswirkungen von NADOO aufgezeigt."
    },
    {
        "chapter_title": "FÜR WEN IST NADOO?",
        "chapter_content": "Das NADOO System bietet einen neuen Ansatz zur Strukturierung von Arbeit und erweitert bestehende Arbeitsverhältnisse. Daher richtet es sich an eine breite Zielgruppe.\nGeschäftsführer, die mit zu viel Arbeit für ihre Angestellten und Schwierigkeiten mit der Suche nach neuen Arbeitskräften konfrontiert sind, können von NADOO profitieren. Auch Unternehmen, die ihr Geschäft ausbauen möchten, aber noch keine volle Stelle vergeben möchten, finden in NADOO eine Möglichkeit, dynamisch auf Auftragsspitzen zu reagieren oder bei einem Auftragsrückgang Entlassungen zu vermeiden.\nAngestellte, die von ständigen Überstunden überfordert sind und nach einer Möglichkeit suchen, ihre Arbeit in der Zukunft wieder bewältigen zu können, sind ebenfalls angesprochen. Sie wollen für ihre Arbeit fair entlohnt werden und ihre Fähigkeiten auch nach der Zugehörigkeit zum Unternehmen einbringen können.\nFreelance Software-Entwickler, die eine Festanstellung mit dem Gehaltspotential eines eigenen Software-Unternehmens verbinden wollen, können von NADOO profitieren. Sie können sich auf das Entwickeln konzentrieren und müssen sich weniger um Kundenakquise kümmern.\nAuch Entwickler, die sich ein nachhaltiges Einkommen aufbauen wollen, finden in NADOO eine echte Alternative zum Werksvertrag und Dienstleistungsvertrag.\nNicht zuletzt spricht NADOO auch Angestellte einer internen IT-Abteilung an, die ihre interne Software resilienter machen und durch externe Fachkenntnisse weiter ausbauen möchten. Sie können auch nach Ende Ihrer Anstellung an der Software weiterarbeiten und davon profitieren. Mit NADOO können sie die Abhängigkeit und den Druck reduzieren, der auf ihnen lastet, wenn sie die einzigen sind, die sich um Probleme mit der Software kümmern können."
    },
    {
        "chapter_title": "WER BIN ICH UND DER AKTUELLE FORTSCHRITT VON NADOO?",
        "chapter_content": "Mein Name ist Christoph Backhaus. Während der Verfassung dieses Kapitels bin ich fünfunddreißig Jahre alt. Ich gehöre zur letzten Generation, die ohne Internet aufwuchs und die Geburt der digitalen Gesellschaft miterleben durfte.\n\nSchon als Kind faszinierten mich Computer und alles, was damit zusammenhängt. Obwohl meine Mutter, alleinerziehend und Sozialhilfeempfängerin während meiner Jugend, wenig Geld zur Verfügung hatte, ermöglichte sie mir den Besitz eines PCs in jungen Jahren.\n\nWährend meiner Schulzeit machte ich meine ersten Programmiererfahrungen. Mangels Vorbildern und aufgrund tiefer Unsicherheit entschied ich mich für einen anderen Karriereweg. Statt in die Softwarebranche zu gehen, absolvierte ich eine technische Ausbildung und studierte anschließend Maschinenbau. Ich fand es spannend, die Entstehung der Dinge um mich herum zu verstehen und die Gründe für bestimmte Entscheidungen nachzuvollziehen.\n\nGegen Ende meines Studiums und besonders während meiner Bachelorarbeit entdeckte ich meine Liebe für Prozesse. Ich fand es faszinierend, wie diese entstehen und wie man sie beschleunigen kann. Während dieser ganzen Zeit behielt ich meine Leidenschaft für die Softwareentwicklung und programmierte immer wieder Tools, die mir und anderen in der Arbeit halfen.\n\nIch wollte im Bereich der Prozessoptimierung tätig werden, fand es jedoch anmaßend, ohne vorherige praktische Erfahrung als Angestellter direkt in eine beratende Position zu wechseln. Daher wollte ich zunächst praktische Berufserfahrung sammeln.\n\nIn meiner ersten Anstellung als Ingenieur war ich sehr unzufrieden, da mich die Aufgaben wenig reizten und ich meine speziellen Fähigkeiten nicht unter Beweis stellen konnte. Erst durch die Teilnahme an einem neuen Projekt und den erneuten Kontakt mit Code konnte ich mein Können wieder zeigen.\n\nIn meiner zweiten Position lernte ich schnell, meinen Wunsch nach Verbesserung zu äußern und stetig dazu beizutragen, Probleme zu lösen. Ich war begeistert, wie wir als Team effizienter wurden und unser Produkt sich verbesserte. Dank der Software und der Optimierungen machten wir weniger Fehler und hatten mehr Zeit, unser Ingenieurwissen einzubringen, statt nur Aufträge abzuarbeiten. Doch auch hier war meine Wirkungsmöglichkeit durch meine Position stark begrenzt.\n\nErst in meiner dritten und vorerst letzten Anstellung erhielt ich weitgehend die Freiheit, all mein erworbenes Wissen einzusetzen. Mein damaliger Vorgesetzter schenkte mir und meinem Team viel Vertrauen und ließ uns freie Entscheidungen treffen. In dieser Zeit lernte ich, wie ich Softwareentwicklung und Ingenieurwesen noch stärker miteinander verknüpfen konnte. Ich durfte einige Tools entwickeln, die meinen Kollegen schon seit vielen Jahren ermöglichen, deutlich mehr ihrer Aufgaben zu erledigen. Ich lernte viel über die Technologien, die ich nun verwende, über Teamarbeit, Projektmanagement und was nötig ist, um Menschen in ihrer Arbeit zu unterstützen.\n\nIn meiner letzten Anstellung war ich hauptsächlich der einzige Entwickler. Leider lag der Fokus auch dort mehr auf den Risiken als auf den potenziellen Vorteilen neuer, an die Aufgabe angepasster Software. Diese Erfahrung und die vieler anderer Softwareentwickler, die ich über die Jahre kennenlernte, inspirierten mich, die Strukturen zu entwickeln, die durch NADOO entstehen.\n\nKurz vor Antritt dieser letzten Anstellung kam mir die Idee zu NADOO. Während meiner Anstellung sammelte ich Informationen und bildete mich in verschiedenen Bereichen weiter. Besonders die rechtlichen Fragen standen in dieser Zeit im Fokus. Ich erkannte, wie komplex es ist, ein eigenes Unternehmen zu gründen, und wo andere scheitern. Anfang zweitausendzweiundzwanzig entschied ich, dass ich bereit war und es an der Zeit war, diese Erfahrungen in ein Unternehmen umzuwandeln. Daher arbeitete ich bis Oktober zweitausendzweiundzwanzig weiter in meiner Anstellung und bereitete vieles vor. Danach konzentrierte ich mich vollständig auf NADOO. Anfangs dachte ich, es würde mir leichtfallen, mit diesem Angebot Kunden zu gewinnen. Schließlich gab es atemberaubende Vorteile und praktisch keine Nachteile im Vergleich zu den bestehenden Konstellationen. Glücklicherweise hatte ich in den vergangenen Jahren einige Rücklagen gebildet, die mir Zeit zum Lernen gaben. Tatsächlich gestaltete sich der Verkaufsprozess als sehr frustrierend. Ich hatte viele Gespräche mit Unternehmern und erzählte ihnen von meinem Angebot. Doch statt mit offenen Armen empfangen zu werden, hörte ich immer wieder: „Das klingt zu gut, um wahr zu sein.“ Ein Einwand, der mich völlig überforderte. Der Gedanke, mein Angebot absichtlich schlechter zu gestalten, verursachte mir Übelkeit.\n\nGlücklicherweise äußerten im Laufe des Jahres zumindest ein paar mutige Unternehmer ihr Interesse. Die Zusammenarbeit gestaltete sich als schwierig, da beide bereits stark ausgelastet waren. In der Zwischenzeit baute ich mein Netzwerk aus. LinkedIn war zu dieser Zeit die Plattform für Unternehmer. Ich besuchte viele lokale Startup-Veranstaltungen, obwohl ich nicht wirklich ein Startup war. Ich war bereits Mitglied im BVMW und im BNI, beides Netzwerke für den Mittelstand und Einzelunternehmer. Besonders IT-Dienstleister, die dringend einen Ausstieg aus dem Projektgeschäft suchten, zeigten sich von NADOO überzeugt. Ich hatte den Geschäftsführer eines dieser Unternehmen auf einer Netzwerkveranstaltung des BVMW getroffen. Es war ein sehr angenehmes Gespräch. Er stellte mir tiefgehende Fragen, die mich zunächst etwas verunsicherten. Doch dann empfand ich es als erfrischend, denn zum ersten Mal seit Langem forderte mich jemand heraus, tiefer zu erklären, statt nur zu erzählen. Am Ende lobte er mich und lud mich in sein Unternehmen ein. Ohne zu wissen, was mich dort erwarten würde, sagte ich zu."
    },
    {
        "chapter_title": "WIESO ICH NADOO ENTWICKELT HABE?",
        "chapter_content": "Solange ich denken kann, war mir immer klar, dass ich nie im Verkauf arbeiten könnte. Ich hatte für mich die Regel geschaffen, dass ich nie jemandem etwas verkaufen kann, solange ich nicht davon vollkommen überzeugt bin, dass es das beste Produkt ist, das ich einem Kunden anbieten könnte. In einem Verkaufsgespräch würde ich meinem potenziellen Kunden immer erklären, was er besser kaufen sollte bzw. was die Probleme mit dem Produkt sind, welches ich eigentlich verkaufen soll. \nAus diesem Grund habe ich das letzte Jahrzehnt in Unternehmen verbracht und stattdessen damit verbracht Produkte zu entwickeln und somit besser zu machen. Ich wollte etwas schaffen von dem ich sagen kann, dass dies das Beste ist, was ich schaffen konnte und die Wünsche von jemandem übertrifft. \nWährend dieser Zeit bestand immer der Wunsch mich selbstständig zu machen bzw. ein Unternehmen zu haben, welches nach meinen Werten und Vorstellungen handelt. \nHäufig kam es zu Situationen, in denen ich klar erkennen konnte, dass unbedachte Entscheidungen getroffen wurden. Ich erlebte zu oft, dass die bestehenden Strukturen viele Probleme mit sich brachten. Da es keinen Weg zu geben schien diese von unten nach oben zu lösen arbeitete ich immer an eigenen Projekten. Diese hatten immer das Ziel ein Produkt zu schaffen, welches ich verkaufen konnte, ohne meine Regeln zu brechen. \nIn meiner Freizeit beschäftigte ich mich viel mit Arbeitspsychologie und vielen Paradoxen bzw. psychologische Effekten, die Produktivitätssteigerung erschweren. Ich habe versucht zu verstehen wie man diese Effekte nutzen bzw. Paradoxe Effekte wie Peter Prinzip, Dunning Kruger oder vor allem dem Parkinson Paradox entgegenzuwirken. Dieses Wissen hat die Struktur von NADOO beeinflusst und sind so formuliert, diese zu bekämpfen oder komplett zu beseitigen.\nEins meiner weiteren Interessenbereiche ist die Ökonomie. Vor allem die Preistheorie. Dieses Feld fand ich besonders faszinierend, da wie ich lernte wie etwas bepreist wird, entscheidend ist für das Verhalten bzw. die Zielsetzung des Anbieters. \nÜber mehrere Jahre hinweg habe ich so verschiedene Preismodelle analysiert und den Zweck derer ermittelt.\nFür mich stand fest, dass ich für mein Produkt ein Preismodell einsetzten möchte, dass wenn ich diese Analyse für das Produkt durchführen würde, ich darin einen positiven Effekt für mich als Kunde sehen kann. \nSo entstand die Produktivitäts-Garantie von NADOO, die in den folgenden Kapiteln behandelt wird.\nDiese Garantie habe ich vor allem entwickelt, um ein ausgeglicheneres Vertrauensverhältnis zwischen Kunde und den Entwicklern des NADOO Systems zu schaffen. Durch die Garantie kann der Kunde viele Aufgaben, die üblicherweise in einer eigenen IT-Abteilung bearbeitet werden würden, an NADOO abgeben. Dank der Garantie bzw. des Preismodells weiß er das er nur für den Erfolg zahlen wird. Langwierige Verhandlungen werden überflüssig, da die Interessen des Kunden und NADOO übereinstimmen. Der Kunde kann frei Steuern wie viel er in IT investieren möchte und erhält immer, was er davon haben möchte. Natürlich wird auch weiterhin ein hohes Maß an Vertrauen vom Kunden gefordert. Der Kunde schließlich gibt viel von seinem Unternehmen preis. Seine Prozesse, Tools, Erfahrungen usw. welche den Kern seines Geschäftes darstellt und für NADOO sehr viel Wert ist. Somit soll diese Garantie das Ungleichgewicht, welches ich bei anderen Methoden der IT-Vergütung wahrnehme, ausgleichen."
    },
    {
        "chapter_title": "WAS IST NADOO?",
        "chapter_content": "NADOO ist mehr als ein neues Konzept der Bepreisung und Digitalisierung. \nEs stellt eine neue Möglichkeit der Arbeit für Personen her, die sich Freiberuflich, selbstständig oder gewerblich betätigen wollen und neben Ihrer Vollzeitanstellung sich weiterentwickeln und neue Arbeitsbereiche testen möchten. \nDas NADOO Netzwerk ist der Zusammenschluss dieser Personen. Es bietet eine Organisatorische Struktur, um die verschiedenen Interessengruppen zusammen zu führen und von Netzwerkeffekten zu profitieren. So können sich die Mitglieder austauschen, Erfahrungen teilen und bei Problemen unterstützen. Es reduziert die Gefahr, dass einzelne Mitglieder sich an einem Problem festbeißen und so Ihren Fortschritt verlangsamen.\nNADOO IT ist die Plattform, die für die Vertragserfüllung und die Erfassung der geleisteten Arbeit zuständig ist. Sie bildet die Mitte zwischen Unternehmen und den Personen, die für Sie die Leistungen erbringen ab."
    },
    {
        "chapter_title": "WIE WIRD SICH NADOO ENTWICKELN?",
        "chapter_content": "In diesem Kapitel will ich Ihnen als Leser eine Vorschau darauf geben, wie sich NADOO in den nächsten Jahren entwickeln soll. Es soll Ihnen helfen die Vision hinter NADOO zu begreifen und Ihnen dabei helfen zu entscheiden ob Sie Teil dieses Prozesses sein wollen. Auch dient es dazu in der Zukunft eine Gegenüberstellung zwischen dem was geplant war und dem was tatsächlich passiert ist zu ermöglichen.\nZum Zeitpunkt, an dem Ich dieses Kapitel verfasst habe, habe ich bereits über 7 Jahre an dem NADOO System gearbeitet. Während dieser Zeit haben sich einige Meilensteine ergeben wie sich NADOO erweitern soll. Sicherlich werden einige dieser Punkte sich durch Ereignisse verändern. Mein Ziel ist es zu versuchen so weit wie möglich diesen Plan umzusetzen."
    },
    {
        "chapter_title": "WIE WIRD SICH NADOO ENTWICKELN? PHASE 1",
        "chapter_content": "BETRIEBSFORM\nIn Phase 1 der Entstehung des NADOO Systems handelt es sich ausschließlich um Christoph Backhaus IT und die dort arbeitenden Angestellten. \nZIELE DIESER PHASE\nIn dieser Phase wird die Kernsoftware zum Betreiben des Systems und der Verwaltung der Komponenten entwickelt.\nKunden beteiligen sich stark bei der Gestaltung der NADOO IT Plattform und bringen durch Ihr Feedback, die auf Unternehmen ausgerichteten Elemente zu einer Reife, die in der Lage ist auf deutlich mehr Kunden erweitert zu werden.\nIn dieser Phase sind etwa 3 Kunden geplant. \nDie Einnahmen, die durch diese Kunden erwirtschaftet werden, sind ausschließlich für die Weiterentwicklung des Systems gedacht. Wie zuvor erwähnt liegt der Fokus dieser Phase auf der Entwicklung der notwendigen Tools, um das Geschäft zu skalieren. Dementsprechend ist die Aufgabe darauf zu fokussieren immer mehr, der seitens Christoph Backhaus IT auftretenden Aufgaben, zu automatisieren bzw. Tools zu schaffen die dabei unterstützen diese Aufgaben zu bewältigen.\nRelativ früh im Prozess werden Studenten mit in das Unternehmen integriert. Diese haben als Hauptaufgabe, für das Erlernen von Softwareentwicklung Kurse zu erstellen und den gesamten Onboarding Prozess zu dokumentieren und so den Einstieg für neue Mitglieder zu erleichtern.\nDas Ziel, dieses auf Anfänger ausgelegten Onboarding Prozesses, ist es, möglichst schnell eine große Anzahl von Entwicklern zum NADOO System hinzuzufügen. \nDadurch soll, wenn ein neuer Kunde dem NADOO System beitritt, dessen Prozesse schnell erfasst, analysiert und mit der Automatisierung begonnen werden. Hierdurch soll für Neukunden ein Effekt entstehen, bei dem sobald er dem System beitritt, praktisch alle Abteilungen und somit Arbeitsplätze mit einer Vielzahl von Entwicklern gleichzeitig betreut werden und innerhalb kürzester Zeit ein hoher Automatisierungsgrad erreicht wird.\nZum Ende dieser Phase ist die Plattform weitgehend entwickelt und es werden mehr Kunden hinzugefügt. Ist die Plattform in der Lage Freie Softwareentwickler zu bedienen beginnt Phase zwei."
    },
    {
        "chapter_title": "WIE WIRD SICH NADOO ENTWICKELN? PHASE 2",
        "chapter_content": "BETRIEBSFORM\nIn dieser Phase wird sich Christoph Backhaus IT umfirmieren in die NADOO Genossenschaft.\nPRODUKTE\nDie NADOO Genossenschaft vertreibt das NADOO IT Konzept an andere Softwareentwickler und diese die es werden wollen. Diese Softwareentwickler werden aus dem NADOO Netzwerk gewonnen und können entweder über die NADOO IT Plattform arbeiten oder es selbst erwerben, selbst betreiben und so weitere Ableger des Systems erstellen.\nAuf der Plattform NADOOIT.de, der NADOO Genossenschaft, werden ab dieser Phase Kunden und Entwickler zusammengeführt. \nEntwickler können direkt an Kundenprojekten arbeiten, Software bereitstellen und dann den Großteil der durch die Software erwirtschafteten Einnahmen über die Plattform erhalten. \nDie NADOO Genossenschaft bzw. andere Freiberufler im Netzwerk können die Software für einen Anteil derer Einnahmen an andere Kunden verkaufen und so mehrfach Arbeit vermeiden, während sich Entwickler auf das Erstellen der Software konzentrieren können. \nAll dies findet vollständig ohne Verwaltungsaufwand für die Kunden bzw. Freiberufler statt. Alle Steuern, Rechtsklärung usw. findet vollständig automatisch statt. Programme werden, auf die von Ihnen hin erhobenen Daten überprüft und eine entsprechende DSGVO erstellt. Hierbei wird NADOO bzw. die Automatisierungen und Integrationen der NADOO Plattform alle Vorgaben des Plattformen-Steuertransparenzgesetz – PStTG erfüllen und übertreffen.\nHierdurch können sich die Entwickler vollkommen auf das Erstellen von Software konzentrieren und unsere Kunden sich sicher seien, dass es innerhalb unserer Software keine Rechtsverletzungen gibt. \nZugleich sind alle Entwickler, die über die NADOO Genossenschaft Aufträge beziehen nie gefährdet unter Scheinselbstständigkeit zu fallen. \nUm sicherzustellen, dass keiner in unserem Netzwerk tätigen Entwickler, Verkäufer etc. in Steuerliche Schwierigkeiten gerät, arbeiten wir eng mit Steuerfachangestellten zusammen. Dadurch verschwindet das Thema Steuern aus dem Leben der Entwickler weitgehendst und gibt Ihnen mehr Zeit sich auf die Entwicklung und pflege der Software zu konzentrieren. \nDefacto wird für Personen, die im NADOO Netzwerk arbeiten, selbstständig sein, deutlich einfacher als einer Angestelltentätigkeit nachzugehen und ab Phase 2 auch deutlich sicherer.\nHauptgründe dafür sind, dass Sie sich auf Ihre Kernthemen konzentrieren können, während Steuern, Kundenakquise, Dokumentation, Vertrieb usw. ähnlich wie dies sonst in einem Unternehmen geschieht weitgehend übernommen wird.\n \nVERTEILUNG DER EINNAHMEN\nWährend in Phase 1 die Einnahmen zwischen Entwickler, Programm und NADOO aufgeteilt werden, werden in Phase 2 die Einnahmen auch direkt an die Anwender der Software weitergegeben. Dies bedeutet, dass die Angestellten für jede Ausführung einen Anteil der Einnahmen erhalten. \nDies kann sich zu einem großen Baustein Ihres Einkommens entwickeln und belohnt die Mitarbeiter, die sich besonders bemühen und sich konstant weiterentwickeln.\nHierzu ist es notwendig, dass auch die Anwender der Software, Mitglied der Genossenschaft werden.\nSollte sich der Anwender gegen dieses Angebot entscheiden, kann er eine Wohltätige Organisation angeben, an die dann die Einnahmen gespendet werden.\nDieses Konstrukt wird mit dem Namen NADOO Mitarbeiter 2.0 vermarktet.\nAuch um die Abhängigkeit, der Mitglieder der NADOO Genossenschaft, von spontanen Aufträgen zu reduzieren, wird in Phase 2 ein weiterer Teil der Einnahmen an alle Mitglieder der Genossenschaft ausgeschüttet. \nDadurch haben alle Mitglieder ein Grundeinkommen, unabhängig von Ihrer eigenen Leistung. Ein solches Einkommen ist wichtig für den Fall, dass ein Teil Ihrer Aufgaben vollständig automatisiert wird und somit Sie für eine Zeit weniger Möglichkeiten haben mit Ihren aktuellen Fähigkeiten ein Einkommen zu generieren. Da für Sie aber bei vollständiger Automatisierung Ihr Grundgehalt steigt, sind Sie für die Gefahr der Obsoleszenz abgesichert.\nDurch diesen Mechanismus ist eins der Kernprobleme der Automatisierung überwunden. Automatisierung ist nun nicht mehr im Konflikt mit den Interessen der Angestellten und Arbeiter, denn Sie profitieren direkt mit von der Automatisierung. Ihre Arbeit und Anteilnahme am Prozess werden direkt gewürdigt und Ihre Zukunft ist gesichert.\nWenn Programme in anderen Betrieben, als dem für welche diese erstellt wurden, ausgeführt werden, erhalten die Angestellten ebenfalls einen Anteil an den durch diese generierten Gewinne. Das so erwirtschaftete Einkommen wird Ihr normales Angestellten Gehalt übertreffen und gibt Ihnen die Möglichkeit Ihrer Haupttätigkeit zu beenden, ohne dieses Grundgehalt zu missen.\nDurch diese Struktur wird über lange Sicht eine neue Zusammenarbeit zwischen Kunde, Konkurrenten und Angestellten erzeugt. Kunden verstehen, dass ein Anteil der Kosten, die Sie tragen an Sie wieder ausgeschüttet werden und Sie dieses Geld bei anderen Unternehmen im Netzwerk verwenden können.\nAuch, sollte ein Angestellter das Unternehmen verlassen, erhält dieser weiterhin Einnahmen durch die von Ihm mit entwickelten Verbesserungen. Somit entsteht eine auch bis dahin nie dagewesene Dynamik. Angestellte haben selbst über Ihre Anstellung hinaus ein Interesse am Erfolg der Firma, die nicht rein intrinsisch ist. Dadurch wird der Wunsch nach Verbesserung gestärkt und die negativen Folgen von Firmenwechseln, egal ob durch selbst Kündigung oder sollte die Stelle im Unternehmen wegfallen, reduziert.\nDie Genossenschaft soll als das menschliche Gegenstück zum „nutzen orientierten“ und größtenteils algorithmischen gesteuerten NADOO System wirken und sicherstellen, dass künstlicher Intelligenz immer im Gleichgewicht bzw. im Interesse von Menschen handelt.\n\nVERÄNDERUNGEN DES MITARBEITERGEFÜGES\nGleichzeitig werden an diesem Punkt, wenn dies vom Kunden gestattet wird, dieselben Aufgaben durch ein Ausschreibungsverfahren für externe Selbständige zugänglich gemacht. \nDank der Schulungsunterlagen steht es den Mitgliedern des NADOO Systems offen, bestimmte Aufgabenschritte zu erlernen und über dieses Verfahren zu bearbeiten. \nDies ermöglicht es den Unternehmen, in Spitzenzeiten, Aufgaben, die nur von Menschen bearbeitet werden können, auszulagern und so flexibel auf Situationen zu reagieren, ohne zusätzliche Personalbindung einzugehen. \nPersonen können durch das Ausschreibungsverfahren neue Arbeitsfelder ausprobieren bzw. erlernen und sind nicht von einer Anstellung bei einem Arbeitgeber abhängig. Personen können so leichter zwischen verschiedenen Arbeitgebern wechseln ohne, dass gleichzeitig Arbeitskraft bei einem bestimmten Unternehmen fehlt.\nDieser offene Aufgabenpool steht auch den Angestellten der Kunden offen. Sollte also in einem Betrieb nicht genügend Arbeit vorhanden sein, um die Angestellten voll auszulasten, können diese auf diesen zurückgreifen. \nDies bietet mehrere Vorteile. So sollte ein Geschäft rückläufig sein, können Angestellte weiterhin im Betrieb verbleiben, laufen so weniger Gefahr entlassen zu werden und können dadurch weiter mit den Personen mit denen Sie gerne zusammenarbeiten arbeiten.\nAndererseits wird es für ein Unternehmen möglich, sollten zu viele Aufgaben vorhanden sein und gleichzeitig zu wenig, als dass es eine weitere Vollzeitstelle rechtfertigen würde, diese Aufgaben zunächst über den Aufgabenpool bearbeiten zu lassen, und erst wenn genügend Arbeitsvolumen vorhanden sein sollte, jemanden zusätzlich fest anzustellen.\nFür viele Unternehmen ist diese Frage nach dem Anstellen eines neuen Angestellten einer der Kernprobleme beim Wachstum, der durch dieses System vollständig gelöst werden kann. Gleichzeitig macht es die Angestellten deutlich weniger abhängig von Ihrer bestehenden Anstellung und ermöglicht es Ihnen Ihren Aufgabenbereich zu erweitern und neue Verantwortungen zu übernehmen und oder komplett neue Arbeitsfelder auszuprobieren."
    },
    {
        "chapter_title": "WIE WIRD SICH NADOO ENTWICKELN? PHASE 3",
        "chapter_content": "Die dritte Phase des NADOO Systems ist die Einführung eines eigenen E-Geldes bzw. einer eigenen Krypto-Währung. Der Grund für diese ist das Leben der Mitglieder noch simpler zu gestalten und dem Schlüssel eine weitere Grundfunktion hinzuzufügen.\nITS DAS E-GELD\nDas in Phase 2 beschriebene Einkommen wird ab dieser Phase als E-Geld ausgeschüttet, kann aber weiterhin in normales Geld umgetauscht werden. Dieser Zwischenschritt wird als zusätzliche Sicherheitsmaßnahme hinzugefügt und gibt den Mitgliedern eine Vielzahl an weiteren Vorteilen.\nDIE VORTEILE, DIE DURCH ITS ENTSTEHEN SIND:\n•\tHöhere Kundenbindung\n•\tGesteigertes Wachstum für Systemmitglieder\n•\tDiebstahl von Geld wird unmöglich dank Blockchain\n•\tTransaktionskosten werden reduziert\n•\t…\nDas besondere durch diese Form des E-Geldes ist, dass es einen kontinuierlichen Zuwachs des im System befindlichen „Geldes“ führt, dass aber eine neue Art der Wertbemessung ist. Der Vorteil davon, dass das E-Geld erst an diesem Punkt eingeführt wird, ist, dass bereits eine nicht insignifikante Anzahl von Firmen existiert, die mit dem NADOO System zusammenarbeiten und somit sehr wahrscheinlich das E-Geld als gültiges Zahlungsmittel akzeptieren werden. \nProblem bei vielen „Krypto“ und „E-Geld“ Finanzmitteln ist, dass es zu Beginn keine legitimen Anwendungen gibt. NADOOs „ITs“ hingegen haben vom Moment Ihrer Erschaffung einen legetimen Anwendungszweck.\nUm die Verwendung von „ITs“ ab diesem Punkt auf Privatkunden zu erweitern, wird unseren Kunden angeboten Ihren Kunden den NADOO Key zu verkaufen. Mit dem NADOO Key können diese dann für Ihre Produkte bzw. Dienstleistungen zahlen auch ohne selbst Mitglieder des NADOO Systems zu sein. \nDas Besondere und wirklich einzigartige am NADOO Key ist, dass auf das damit verbundene Konto jeden Monat ein Guthaben überwiesen wird, welches der Besitzer dann frei verwenden kann. Das bedeutet der Kunde, der den Schlüssel hat, bekommt jeden Monat eine Summe X auf seinen Schlüssel gutgeschrieben, welches er dann in den Geschäften bzw. für Dienstleistungen der Kunden des NADOO Systems einsetzen kann.\nWas dabei passieren wird ist, dass die Halter der Schlüssel nicht nur das Ihnen frei zur Verfügung stehende Guthaben verwenden werden, sondern auch aufgrund der hohen Sicherheit und wie komfortabel deren Anwendung ist, zusätzliches Guthaben auf Ihren Schlüssel übertragen werden.\nDieses von den Kunden zur Verfügung gestellte Geld wir dann in zusätzliche Automatisierungen investiert und als eine Art Rendite an die passiven „Investoren“ wieder ausgeschüttet.\nAb diesem Punkt wird NADOO als Finanzdienstleister auftreten und wie eine Bank in der Lage sein Fraktional Banking zu betreiben, wodurch ein wesentlich höheres Investitionsvolumen möglich wird als das im System tatsächlich vorhandene Geld."
    },
    {
        "chapter_title": "WAS IST DAS NADOO NETZWERK?",
        "chapter_content": "Das NADOO Netzwerk ist ein Zusammenschluss von Freiberuflern, Angestellten, Selbständigen, Unternehmern und Personen, die am NADOO System interessiert sind. \nÜber es können sich die Mitglieder gegenseitig austauschen und bei Ihren jeweiligen Projekten unterstützen. Das NADOO System unterstützt das Netzwerk, um zum einen neue Entwickler und Unternehmer zu werben aber auch um seine Bekanntheit und damit Reichweite zu erweitern.\nDas NADOO Netzwerk hat als sein Hauptziel die Herausforderungen, die durch eine Selbständigkeit entstehen zu reduzieren und Ihren Mitgliedern beim Verwirklichen Ihrer Träume/Ideen zu helfen. Ihr Hauptgrund dazu ist, dass jedes so erfolgreiche Mitglied wieder Wert für NADOO schafft, selbst wenn nur durch die Steigerung des Bekanntheitsgrades des Netzwerkes an sich."
    },
    {
        "chapter_title": "WAS IST NADOO IT?",
        "chapter_content": "NADOO IT ist eine neue weitere Strukturierungsmöglichkeit für IT. Diese kann zusätzlich zu bereits bestehenden Strukturen in Unternehmen oder alleinständig eingeführt werden.\nDiese neuartige Strukturierung wird durch den entwickelten Arbeitsvertrag des NADOO Systems zum ersten Mal ermöglicht. \nSie zeichnet sich vor allem durch ein für Business to Business, neuartiges leistungsorientiertes Preissystem aus, dass die Geschwindigkeit für neue IT-Projekte in Unternehmen beschleunigt und gleichzeitig die Qualität und Sicherheit der Software sicherstellt.\nFür Softwareentwickler ermöglicht es zum ersten Mal, Software als einen kontinuierlichen Prozess zu sehen, bei dem die Abhängigkeit von Aufträgen reduziert wird und deutlich ergebnisorientierter gearbeitet werden kann.\nEs verschafft Unternehmen die Möglichkeit Ihre Prozesse zu erfassen, mittels Processmeining auszuwerten und, wenn gewünscht, ein vom eigenen Unternehmen unabhängiges leistungsorientiertes Vergütungssystem für Ihre Angestellten einzuführen. Durch dieses Vergütungssystem, unter dem Namen „NADOO Mitarbeiter 2.0“, werden ganz neue Anreize für Mittarbeiter geschaffen, die zu mehr Mitarbeiterzufriedenheit und längerer Unternehmenszugehörigkeit führen werden.\nIn den nächsten Kapiteln könnte es zu Verwirrung zwischen dem NADOO System, welches die Gesamtstruktur, die durch NADOO realisiert wird, und NADOO IT kommen.\nNADOO IT bezieht sich auf ein drei Säulen Modell zur Abbildung der IT. Bestehend aus Unternehmen, NADOO als verwaltende Instanz und den Entwicklern der Software. \nSollte es dazu kommen, dass diese Trennung noch unklar ist, seien Sie beruhigt das es sich hier mehr um eine Semantik handelt. Das Verständnis was insgesamt durch NADOO realisiert werden kann ist entscheidend und nicht unter welchen Bereich der Struktur die einzelnen Aufgaben fallen."
    },
    {
        "chapter_title": "WAS MACHT NADOO IT BESONDERS?",
        "chapter_content": "Dieses Kapitel beschäftigt sich mit der Entstehungsgeschichte des Bepreisungsmodells, deren Vorteilen und wie es sich von den derzeit gängigen Modellen unterscheidet. \nEs ist entscheidend das Preismodell zu verstehen, da es die Grundlage für alle weiteren Kapitel bildet und erklärt, wieso diese überhaupt möglich werden. \nEs ist das entscheidende Unterscheidungsmerkmal von bestehenden Modellen der IT-Gestaltung. Ohne das Verständnis des Bepreisungsmodells könnten andere Teile dieses Dokuments unglaubwürdig erscheinen."
    },
    {
        "chapter_title": "WAS IST DAS WIN WIN WIN PREISMODELL?",
        "chapter_content": "Wie in der Einleitung erklärt, habe ich mich während der Entwicklung von NADOO IT viel damit beschäftigt, wie das endgültige Produkt verkauft wird. Wie bei vielen „neu“ Entwicklungen habe ich mich hierbei an bereits existierenden Modellen orientiert, diese miteinander vermischt und so etwas Neues geschaffen. So war mir recht früh bewusst, dass ich meinem Kunden eine Garantie darauf geben wollte, dass mein Dienst tatsächlich zu Ergebnissen führt. Somit kam nur ein Modell basierend auf Erfolg bzw. Leistungsorientierter Bezahlung in Frage. Dies war mir sehr wichtig da ich die Problematiken, die häufig durch Einmalzahlung und Abo Modelle, die typisch für SaaS Software sind, verhindern wollte.\nUm den Unterschied des Modelles bzw. wieso das NADOO Preismodell so besonders ist, zu verdeutlichen, folgt jetzt eine kurze Gegenüberstellung der Bezahlsysteme."
    },
    {
        "chapter_title": "EINMALZAHLUNG IM VERGLEICH MIT NADOO MICROTRANSAKTION",
        "chapter_content": "Das Einmalzahlungsmodell war, und in manchen Bereichen ist es das immer noch, die Idee das der Kunde für ein Produkt einmal bezahlt und dann dieses in dem Istzustand erhält.\nEin entscheidendes Problem mit diesem Modell, ist das es Software falsch versteht. Genau wie man ein Auto nicht einmal kauft und dieses auf magische Art und Weise für immer funktioniert, ist auch bei Software eine regelmäßige Wartung notwendig. Software benötigt Wartung und erreicht seine wirkliche Reife in einem Weiterentwicklungsprozess. Aus diesem Grund haben solche „Einmalzahlung“ Produkte oft einen Wartungsvertrag mit integriert. Bei Standardprodukten jedoch gab es diesen häufig nicht. Um aber den Kunden möglichst sicher zu halten wurden Updates kostenlos zur Verfügung gestellt. Wichtig dabei ist, kostenlos für den Kunden und nicht für den Hersteller. Das Problem ist, dass nach dem Kauf, der Kunde so keinen oder nur minimalen Einnahmenstrom für den Hersteller bedeutet. Wenn neue Versionen der Software verkauft werden, die mit der vorherigen nicht mehr kompatibel sind, müssen die alten Versionen dennoch weiter gewartet werden. Wenn sich vom Hersteller dann dagegen entschieden wird, weiter Updates anzufertigen, ist es sehr gut möglich das Kunden mit einer veralteten und möglicherweise gefährlichen Software weiterarbeiten. So wird das Bedürfnis nach einer sicheren Software auf Seite des Kunden nicht befriedigt und auch die des Entwicklers nach Einnahmen für seine Arbeit. \nAus diesem Grund entwickelte sich das jetzt weit verbreitete Modell der SaaS Software bzw. über Abo Modelle Software zu vertreiben.\nDoch bevor ich auf dieses eingehe, hier wie NADOO diese Probleme löst.\nNADOO lässt einen Kunden frei entscheiden darüber wie viel er in mehr Leistung investieren möchte. Egal wie wenig oder wie viel das sein mag. Durch diese Bezahlart sind die Entwickler daran interessiert maximalen Nutzen für den Einzelkunden zu schaffen, da es im Gegensatz zur Einmalzahlung nicht darum geht die maximale Anzahl von Neukunden zu finden. Auch umso mehr der Kunde mehr Leistung erwirbt, zieht er weitere Entwickler an. Hierdurch entsteht ein positiver Feedbackloop. \nKunde kauft mehr Leistung -> Kunde macht mehr Umsätze -> Mehr Entwickler entwickeln Software -> Kunde kauft mehr Leistung\nDieser Feedbackloop wiederholt sich, bis die maximale mit dem Produkt erwartbaren Einnahmen generiert werden.\nBei einem Standardprodukt, das von einem einzelnen Unternehmen entwickelt wurde, kann nur auf das Wissen der Entwickler, die beim Hersteller arbeiten zurückgegriffen werden. Bei Software im NADOO Systems stehen dem Kunden potenzielle Experten aus allen Bereichen zur Verfügung, die sich dann an diesem Feedbackloop beteiligen. Da der Programmcode dem Unternehmen offen vorliegt, kann die Software auch selbst weiterentwickelt werden. Der Kunde ist somit nicht von Entwicklern des NADOO Netzwerks abhängig."
    },
    {
        "chapter_title": "SAAS IM VERGLEICH MIT NADOO MICROTRANSAKTIONEN",
        "chapter_content": "Das Abo Modell ist in vielen Bereichen weit verbreitet, insbesondere bei Software as a Service (SaaS). Es bietet dem Kunden die Möglichkeit, ein Produkt regelmäßig zu nutzen, ohne dafür eine große Einmalzahlung zu tätigen. Allerdings hat dieses Modell auch einige Nachteile, die im Vergleich zu NADOO's Microtransaktionen-Modell deutlich werden.\nEin wesentlicher Nachteil des Abo Modells ist, dass der Kundenerfolg für den Hersteller oft wenig von Bedeutung ist. Dies liegt daran, dass der Kunde in der Regel nur einen kleinen Teil der Gesamtkundschaft des Herstellers darstellt und der Hersteller nicht direkt am Erfolg des Kunden beteiligt wird. Somit ist es für den Hersteller oft nicht attraktiv, sich um den Erfolg des einzelnen Kunden zu kümmern oder die Software an die Bedürfnisse des Kunden anzupassen.\nIm Gegensatz dazu ist bei NADOO's Microtransaktionen-Modell der Kundenerfolg für den Hersteller von großer Bedeutung. Durch das frei wählbare Bezahlmodell ist der Hersteller daran interessiert, dass der Kunde möglichst viel Nutzen aus der Software zieht und somit auch bereit ist, mehr für die Leistungen von NADOO zu bezahlen. Dies führt zu dem vorher beschriebenen positiven Feedbackloop, in dem der Kunde mehr investiert, mehr Umsätze macht und somit weitere Entwickler für das NADOO System anzieht. Auf diese Weise wird die Software stetig verbessert und an die Bedürfnisse des Kunden angepasst.\n\nDarüber hinaus bietet das Microtransaktionen-Modell von NADOO eine größere Flexibilität für den Kunden. Im Gegensatz zum Abo Modell, bei dem der Kunde an eine feste Bezahlstruktur gebunden ist, kann er bei NADOO selbst entscheiden, wie viel er in mehr Leistung investieren möchte. Dies ermöglicht es dem Kunden, individuell auf seine Bedürfnisse und seine finanziellen Möglichkeiten zu reagieren.\nInsgesamt bietet NADOO's Microtransaktionen-Modell eine Alternative zum Abo Modell, bei der der Kundenerfolg im Fokus steht und der Kunde mehr Flexibilität und Anpassungsmöglichkeiten hat."
    },
    {
        "chapter_title": "PAY AS YOU GO",
        "chapter_content": "Pay as you go ist ein recht neues Modell, das derzeit den Microtransaktionen des NADOO Systems am nächsten kommt. \nSo wird auch bei diesem Modell für die einzelnen Ausführungen gezahlt. Wie im NADOO System richten sich auch die Kosten nach der Verwendung der Software.\nHier endet die Ähnlichkeit zwischen diesen beiden Modellen. Das Microtransaktionsmodell von NADOO IT ist mehr als ein reines Micropaymentsystem. Ein „klassisches“ Modell wie Pay as you go ist Nutzungsorientiert, während NADOO, Nutzenorientiert ist. Bei Pay As you Go ist weiterhin die Frage der Preisbildung unabhängig vom Endkundennutzen. Der Preis entsteht im NADOO System dagegen direkt aus der ersparten Zeit und steht so nie der Gefahr von zu hohen Kosten gegenüber. So gibt es im NADOO System sogar Tools/Automatismen, für die der Kunde Gutschriften erhält, die wiederum mit anderen verrechnet werden.\nWährend also beim Pay as you go Modell die Verantwortung für den tatsächlichen Nutzen beim Endanwender liegt, ist es im NADOO Modell tatsächlich beim Hersteller der Software. Denn nur wenn der Nutzen erzeugt wird, der durch das NADOO Preismodell garantiert ist, kommt es auch zu einem Zahlungsvorgang."
    },
    {
        "chapter_title": "WIE IST DAS PREISSYSTEM ENTSTANDEN?",
        "chapter_content": "Während der Zeit, in der Ich das NADOO System entwickelte, wurde im Spielebereich das Zahlungsmodell der Microtransaktionen immer beliebter. Vor allem, um bestimmte Dinge in Spielen „leichter“ zu gestalten oder „Wartezeiten“ zu umgehen, ermöglichten Entwickler immer mehr die Möglichkeit für kleinere Zahlungen. Hierdurch können sich zahlende Kunden Vorteile gegenüber Ihren Konkurrenten verschaffen bzw. das Spielerlebnis angenehmer gestalten. Dieses Modell hatte für lange Zeit in Spielen einen schlechten Ruf, da es „unfair“ sei. Personen, die mehr Geld haben können Spiele dominieren und sich gegen andere durchsetzen. Dies wird häufig als „Pay to Win“ bezeichnet. In Spielen mögen wir Fairness, da es hier es nur auf das Können ankommen und jeder mit genügend Leistung „gewinnen“ können soll. Wie wir wissen, ist das Leben nicht „fair“ und „Pay to Win“ ist für uns im echten Leben vollkommen selbstverständlich. Große Unternehmen können mittels großer Entwicklungsbudgets oder durch Kampfpreise Konkurrenten ausstechen und somit „gewinnen“. Für kleinere Unternehmen ist dies in den meisten Fällen nicht möglich. Hier bieten Microtransaktionen ein riesiges Potential, denn Sie ermöglichen es auch kleineren Unternehmen Zugriff auf „Pay to Win“ in dem Maß, in dem es Ihnen Ihr Budget zulässt. Richtig bepreist kann somit eine Microtransaktion, also eine Investition, direkt zu einem Gewinn beitragen. Dies kann einen Domino Effekt auslösen bei dem jede Microtransaktion direkt einen „ROI“ (Return on Investment“) zulässt und somit zu einer sofortigen Steigerung der Einnahmen führt, welche wiederum durch einen weiteren Einsatz einer Microtransaktion zu einem weiteren Gewinn führt. \nNachdem ich mich längere Zeit mit diesem Dominoeffekt beschäftigte erkannte ich, dass es noch viele weitere positive Effekte mit sich bringt. Diese und viele weitere Besonderheiten werden in den folgenden Kapiteln erklärt."
    },
    {
        "chapter_title": "WIE ERMITTELT SICH DER PREIS?",
        "chapter_content": "Im Gegensatz zu anderen IT-Dienstleistern ist das NADOO Preissystem darauf ausgelegt das maximale Wachstum beider Parteien zu erzielen. So wird der Preis der Stunde nicht fix festgelegt, sondern ist algorithmisch bestimmt, um das maximale Wachstum an Umsatz zu generieren. Dies kann bedeuten, dass wenn durch den Algorithmus erkannt wird, dass mehr Investment in IT sich positiv auf das Gesamtgeschäft des Kunden auswirkt, wird der Preis der Stunde so angepasst, dass der Kunde bereit ist, maximal darin zu investieren. Dies kann sowohl eine Preiserhöhung als auch eine Preissenkung sein.\nSollte durch den Algorithmus erkannt werden, dass der Preis zu hoch ist und das Wachstum des Kunden dadurch negativ beeinflusst wird, wird der Preis nach unten hin korrigiert. Dies kann so weit gehen, dass sogar dem Kunden Stunden geschenkt werden bzw. der Preis ins Negative geht, sollte der Algorithmus dies als die optimale Wachstumsstrategie erkennen.\nEs ist also nicht das Ziel des Algorithmus JETZT den maximalen Gewinn aus einem Kunden zu extrahieren, sondern über die Zeit der Zusammenarbeit hinweg ein stetiges Wachstum zu generieren, denn nur ein finanziell wachsender Kunde ist ein Kunde, der auch mehr in das NADOO System investieren kann und wird.\nIm Allgemeinen fällt und steigt der Preis anhand der Nutzung der Software. Dies soll den Kunden dazu motivieren die Software so häufig wie nötig zu verwenden. So bleibt der Preis für Funktionen, die selten verwendet werden hoch und garantiert so deren Wartungs- und Entwicklungs-Budget. Gleichzeitig fällt der Preis für Programme, die ständig verwendet werden kontinuierlich bis zu einem Basis Preis ab (Auf den der oben genannte Algorithmus Einfluss hat), wodurch die Kosten für das Kerngeschäft stetig fallen und so das Wachstum des Kunden maximiert wird. Gleichzeitig werden so mögliche Arbeitsschritte erkannt, die eventuell vollständig abgeschafft bzw. in einen profitbringenden Prozess umgewandelt werden könnten."
    },
    {
        "chapter_title": "WIESO DER PREIS PRO ERSPAARTER ZEIT EINE NEUE FORM DER ZUSAMMENARBEIT ERZEUGT",
        "chapter_content": "Dadurch, dass kein Produkt oder Dienstleistung an sich verkauft wird, sondern der Effekt, der Tools und Methoden, entsteht eine neue und bis dato nie dagewesene Dynamik.\nDurch diese Preisstruktur sind die Mitglieder des NADOO Netzwerks nur daran interessiert maximale Effektivität zu erzeugen. Nicht wertschöpfende Arbeit wird so erfasst und eingestellt bzw. durch das Fehlen von Einnahmen „verkümmert“.\nAuf der anderen Seite wird dadurch, dass jede Anwendung erfasst wird und die Umsätze direkt den Tools zugeschrieben werden können, automatisch erkannt was gewinnbringende und wachstumssteigernde Tools sind. Der Fokus der Entwicklung wird durch ihren Nutzen direkt geleitet. Wenn ein Tool mehrere Anwendungszweige hat, so wird auf Dauer der kritische Pfad gefördert und weiterentwickelt, während die unkritischen Pfade zunächst nur minimales „Erkenntnis-Investment“ erhalten.\nHierdurch wird das Produkt-Management von Vermutungen über möglichen Effekten hin zu tatsächlicher Effektivität um fokussiert.\nEgal wie „cool“ ein neues Tool sein mag, sollte es nicht dazu führen, dass insgesamt mehr Zeit erspart und somit Einnahmen generiert werden, wird dieses Tool „sterben“.\nHierbei ist wichtig zu verstehen das tatsächlich mehrere Wege zu mehr ersparter Zeit führen können! \n\nHier eine Liste von möglichen Wegen:\n1.\tReduzieren von Zeit für absolut notwendige Arbeitsvorgänge\n2.\tReduzieren von Fehlern, wodurch Mehrarbeit pro Auftrag vermieden und somit mehr Aufträge insgesamt und somit mehr der in 1. genannten Arbeitsvorgänge ausgeführt werden\n3.\tBessere und somit effektivere Workflows wodurch sowohl 1 und 2 erreicht werden können\n4.\tTools die zu besseren wirtschaftlichen Entscheidungen führen, wodurch höhere Umsätze pro Kunde möglich sind, was auch einen höheren Preis pro Stunde zulässt. Durch diese höheren Preise pro Stunde steigt auch der Umsatz pro Auftrag für das NADOO System\n5.\tTools die zu mehr Aufträgen und somit zu mehr der in 1. genannten Arbeitsvorgängen führen\n6.\tTools und Dokumente, die dem Wachstum des Kunden helfen und so dem Kunden ermöglichen mehr Kunden zu bedienen und so zu mehr der in 1. genannten Arbeitsvorgänge führen\nWie hier gut zu erkennen ist entsteht durch das NADOO Preissystem eine erfolgsorientierte Dynamik. \nDies steht im klaren Gegensatz zu klassischen Abo Modellen. Hier spielen diese Punkte keine bis minimal eine Rolle, da nur die Anzahl der verkaufen Abos wichtig ist. Ob diese tatsächlich einen positiven Effekt haben, ist weitgehend irrelevant. Typisch für Abo Modelle sind sogenannte Upsells. Bei diesen wird versucht durch Premium Features, die für den Kunden nützlich sein könnten, mehr Gewinn pro Abo zu erzielen. Wieder werden dem Kunden Tools verkauft, die er möglicherweise nicht gebrauchen wird und schlimmstenfalls sogar eine negative Auswirkung auf sein Geschäft haben, wenn er dies tut.  Da in den meisten Fällen jeder einzelne Kunde nur ein geringfügiger Anteil des Gesamteinkommens des Abo Verkäufers darstellt, sind deren Erfolg und schlimmstenfalls Bankrott für den Anbieter wenig entscheidend für das Gesamtergebnis.\nEs ist mir wichtig zu betonen, dass es sich hier bei den negativen Effekten keinesfalls um eine Absicht der Entwickler oder Hersteller der Software handelt, sondern rein Resultate des Zahlungssystems. Auch handelt es sich hier nicht um absolute.\nKunden des NADOO Systems dagegen sind jeder einzelne ein wesentliches Kerngeschäft. Die Umsätze pro Kunde sind praktisch unlimitiert und von dessen Erfolg abhängig. Dadurch ist NADOO darauf fokussiert es dem Kunden ermöglichen zu wachsen, ohne den Kunden zu überlasten. Das gemeinsame Wachstum ist entscheidend für den Erfolg der Partnerschafft."
    },
    {
        "chapter_title": "WAS SIND DIE AUSWIRKUNGEN DIE DURCH DAS BEPREISEN VON ZEITERSPAARNIS ENTSTEHEN?",
        "chapter_content": "Beim klassischen Bepreisen des Produkts anstelle des Effekts entstehen eine Vielzahl von Problemen.\nSo ist es nötig, dass entweder die Entwickler, Produktverantwortliche, Anwender (Kunde) oder Entscheidungsträger (Kunde) selbst Entscheidungen über die Gewichtung des Budgets und oder Entwicklung treffen. Dies birgt das Risiko, dass die einzelnen Parteien unterschiedliche Wertungen haben und Ziele verfolgen. \nSo neigen Anwender dazu Programme für Aufgaben zu erbeten, die Ihnen unangenehm bzw. die für Sie noch neu sind. Dabei geht es also vorwiegend um eine Vermeidung von Anstrengung. Diese Aufgaben jedoch sind nicht zwingend entscheidend für das Gesamtergebnis. Sie haben auch noch zu viele Unbekannte und eigenen sich meist eher schlecht für die Automatisierung. Es sind besonders Aufgaben, die bereits seit längerem bestehen und für die die meisten Fragestellungen schon aufgetreten sind, die am besten automatisiert werden können.\nAnwender, die in Entscheidungsträgerrollen arbeiten, erbeten oft Software, die Ihnen dabei helfen soll, besser Entscheidungen zu treffen. Wie beim vorherigen Anwender also vor allem eine Vermeidung von Anstrengung bzw. Fehlervermeidung durch bessere Prognosemöglichkeiten. Diese Art von Software ist wichtig und auch berechtigt, um Kapital effektiv einzusetzen. Besonders zu Beginn des Automatisierungsprozesses ist jedoch dieser Typ Software verfrüht. Software dieser Art führt in der Regel nicht zu einer Reduktion der Gesamtdauer einer Auftragsbearbeitung. Somit sind Programme, die auf diese Bereiche abzielen vorerst im klassischen Bezahlsystem anzusiedeln. Auch dieser Typ Software wird später durch NADOO finanziert. Da es bei NADOO im Ersten Schritt um die Steigerung der Produktivität von Unternehmen geht, sind diese Programme zunächst weniger geeignet. Solche Programme eigenen sich besser für den Zeitraum nachdem bereits ein Großteil der Geschäftsprozesse automatisiert und Daten in einer Form vorliegen, die in neuen Tools verwendet werden können.  Denn dann ist der Hebel, der durch solche Entscheidung entsteht, deutlich größer.\nEntwickler als Entscheider für die Wahl der zu entwickelnden Software sind auch zu vermeiden. Entwickler haben wenig Bezug zu den tatsächlichen Bedürfnissen Ihrer Kunden. Sie lassen sich schnell von neuen Technologien beeinflussen und können sich an Problemen festbeißen. Eine Bezahlung auf Basis von Arbeitszeit anstelle von Produktivität führt schnell dazu, dass Entwickler ewig an einer Aufgabe verbringen und Produkte überoptimieren, die bereits in der Lage wären, das gewünschte Ziel weitgehend zu erreichen. Durch einen Shift auf nutzungsbezogene Budgets bzw. Produktivität für Problemlösungen, sind Entwickler angehalten so schnell es geht ein MVP (minimal viable Product) abzuliefern. Wenn dieses dann tatsächlich verwendet wird, entwickelt es ein eigenes Budget und wird dann entsprechend seiner Nützlichkeit auch verbessert. Hierdurch entsteht eine deutlich iterativere Arbeit an Problemlösungen, was auf Dauer besser die Aufgaben beseitigt und auch die Zusammenarbeit mit dem Kunden verbessert, da er mehr und früher mit einbezogen wird. Es steht der Benefit für den Kunden im Fokus anstelle des Verlangens des Entwicklers nach Perfektion.\nZuletzt steht der Product owner. Product owner sind im klassischen Modell verwaltende Personen für ein bestimmtes Produkt (Software). Diese werden immer versuchen Ihr Produkt zu vergrößern und zu erweitern ob dies sinnvoll ist oder nicht. Sie werden nicht anhand von der Effektivität Ihres Produkts bemessen, sondern an deren Verkaufszahlen und dem Team, das Sie führen. Sie entscheiden anhand vom Feedback von Kunden und eigener Ideen wie ein Produkt weiterentwickelt werden soll. Hierdurch können Produkte entstehen, die sich negativ auf dem Arbeitsfeld und das Gesamtergebnis des Kunden auswirken. Hier ist wichtig zu verstehen, dass auch hier dies nicht auf ein „böswilliges“ Verhalten des Product owner zurückzuführen ist, sondern rein ein Resultat des Zahlungssystems.\nIm NADOO System sind diese Entscheidungen hinfällig. So beginnen alle Kunden das NADOO System an den drei in jeder Prozessstruktur unerlässlichen Punkten. Dem Start eines Prozesses (Auftrag), dem Ende eines Prozesses (Auftrag) und der Beschaffung von Materialien bzw. dessen Bezahlung. Von diesen drei Punkten aus werden immer mehr Tools platziert, bis sich eine klare netzförmige Struktur dieser einstellt.\nIm NADOO System haben alle Programme ein eigenes Konto. In diese Konten fließt ein fester Anteil aller durch die Anwendung erworbener Einnahmen. Dadurch entsteht ein automatisches Budget für die Weiterentwicklung, Erweiterung und Wartung dieser Programme. Durch dieses sich automatische bildende Budget werden Programme, die entweder häufig verwendet werden oder die besonders viel Zeit ersparen; und somit auch einen hohen Nutzen haben, stärker weiterentwickelt, während Programme, die eine kleine Auswirkung auf das Gesamtsystem haben nur ein absolutes Minimum an Aufmerksamkeit bekommen. \nDas Besondere an diesem Budgetsystem ist, dass es automatisch den kritischen Prozessweg, der zur Erfüllung der meisten Aufträge notwendig ist, ermittelt und zum anderen falsch Allokation von Entwicklungszeit und damit Geld verhindert bzw. deutlich verringert wird.\nEntwickler entscheiden anhand der Budgets selbst, ob Sie an einem Programm arbeiten wollen oder nicht. Sie können selbstständige Teams bilden und so zusammen an den jeweiligen Programmen arbeiten. So bilden sich automatisch optimale Teams, die sich notwenige Mitglieder heranziehen ohne die Notwendigkeit von Verwaltung oder Zuweisung. Dadurch das die Programme ein auf Ihrer Nützlichkeit stetig steigendes Budget bilden, wird für die Weiterentwicklung nie zu viel gezahlt. Es bilden sich immer dann Teams um ein Programm, wenn diese, für den entsprechenden Preis, die Arbeit beginnen wollen. \nAuch ermöglicht es Preisdruck unter den Teams. \nHat ein Team begonnen ein Programm zu entwickeln können andere Teams, solange die Entwicklung nicht abgeschlossen ist dennoch auch die Entwicklung beginnen. So können sich die verschiedenen Teams im NADOO System die Aufträge gegenseitig wegnehmen. Dadurch wird noch mehr ein Fokus darauf gerichtet Programme möglichst schnell zu liefern oder wenn zu erkennen ist, dass ein anderes Team schneller das Programm abschließen wird, die Entwicklung einzustellen. \nDies sorgt gleichzeitig für mehr Kooperation unter den Teams. \nSo können sich Teams zusammenschließen, um gemeinsam Probleme, für die besondere Spezialkenntnisse notwendig sind, zu lösen und so das Risiko zu verringern leer auszugehen. Über die Zeit werden sich so Experten Teams bilden, die für bestimmte Aufgaben herangezogen werden. Diese Teams entstehen organisch anhand von der guten Zusammenarbeit unter den Personen und werden nicht durch Entscheidungsträger erzwungen.\nAuch um zu verhindern, dass ein anderes Team schneller ein Programm fertigstellt, werden die Programme deutlich kleiner gehalten und häufiger abgeliefert. Das führt zu besser wartbarer und auch wiederverwendbarer Software.\nInsgesamt führt das NADOO System so zu einer Verschiebung von Wünschen von Kunden, Entwicklern und Entscheidungsträgern hin zu einer Bedarfsorientierten-Entscheidungsfindung der Prozesse. Es entfernt Verwaltungskosten und fördert Zusammenarbeit und Wiederverwendung von bereits bestehenden Tools, um Zeit zu sparen. So können sich Anwender und Entscheidungsträger auf Ihre Kernbereiche konzentrieren und neue Methoden testen und entwickeln."
    },
    {
        "chapter_title": "WIESO IST NADOO MEHR ALS EIN BEPREISEN VON ZEITERSPAARNIS?",
        "chapter_content": "Durch das Bezahlen pro Ausführung könnte es beim Kunden zu einer Besorgnis kommen die Software zu verwenden, wenn er an diesem Punkt noch unsicher ist, ob der Auftrag je zum Abschluss kommt. \nUm diese Unsicherheit auszuschließen, werden in naher Zukunft bzw. so bald wie möglich, alle Ausführungen einem bestimmten Auftrag automatisch zugeordnet. Wird der Auftrag nicht abgeschlossen, entstehen so auch keine Kosten. Denn PC-Zeit ist fiktiv und wird von uns nicht mit Lebenszeit gleichgestellt. Dadurch kann der Kunde Aufträge automatisch annehmen und bearbeiten lassen, ohne die Sorge zu haben, zusätzliche Kosten zu erzeugen. Gleichzeitig wird es deutlich interessanter die Automatisierungen zu verwenden, denn während Angestellten Kosten nicht erstattet werden und verloren gehen, besteht dieses Risiko nicht mehr für die Automatisierungen. Die Automatisierungen werden also kein Teil mehr von Misserfolgen und Erfolgen, sondern rein von Erfolgen.\nGleichzeitig erzeugt das auf der Seite der Entwickler einen zusätzlichen Anreiz die Kundenbearbeitung so erfolgreich wie möglich zu gestalten, denn nur wenn ein Kunde von Auftrag-Annahme, bis Abschluss geführt wird, entstehen Einnahmen. Software und Anwendungen, die somit Kundenunfreundlich sind und so dazu führen, dass der Kunde abspringt, werden unprofitabel und eingestellt, während freundlich gestaltete Software wächst. Gleichzeitig steigt auf der Seite der Entwickler auch der Druck hochprofitable und zielgerichtete Kundenakquise zu betreiben. Während ohne diese Ausrichtung ein Ziel hätte sein können, so viele Leads wie möglich zu generieren, um so mit dem Anfang des Bearbeitungsprozesses bereits Einnahmen zu generieren, ist nun die gesamte Prozesskette entscheidend für den einzelnen Baustein. Keiner der Prozess Elemente kann mehr vernachlässigt werden und erhält den notwenigen Fokus, um ein optimales Ergebnis zu erzielen. Dies führt dazu das Entwickler sich auch an Bereichen des Prozesses beteiligen bzw. Investments in Bereiche des Prozesses tätigen, in denen Sie selbst weder die Hauptentwickler noch Prozessbesitzer sind."
    },
    {
        "chapter_title": "WIE BRICHT NADOO DAS PARKINSON’SCHE GESETZ?",
        "chapter_content": "Das Parkinson’sche Gesetz besagt, dass eine bestimmte Menge an Arbeit den dafür bereitgestellten Zeitraum ausfüllt. Dies bedeutet aber auch, dass wenn durch Optimierungen Teilaufgaben automatisiert werden, kann es sein, dass die anderen Aufgaben den Raum der ersparten Zeit einnehmen und so die Steigerung der Produktivität ausbleibt. Hierbei ist zu beachten, dass bei den Aufgaben, die den Zeitraum einnehmen es sich weitgehend um Verwaltungsarbeit handelt. Also der Anteil der verwaltenden Arbeit im Verhältnis zur verarbeitenden Arbeit steigt.\n\nNADOO hat mindestens 5 Bausteine, die dazu führen, dass das Parkinson’sche Gesetz gebrochen wird und eine echte Produktivitätssteigerung stattfindet.\n1.\tIm NADOO System wird systematisch jeder Arbeitsschritt optimiert und so werden über die Zeit hinweg bestimmte Arbeitsschritte vollständig verschwinden, was verhindert, dass diese sich ausdehnen können.\n2.\tWenn nach der NADOO IT Methode gearbeitet wird, wird jede Form von Verwaltungsarbeit automatisch verringert, was einer der Hauptfaktoren bei Parkinson’schen Gesetz ist. Nachdem das Interface auf das Webinterface umgestellt wurde, haben Angestellten keinen Einblick mehr über Ihren Arbeitsvorrat. Aufgaben werden Ihnen in einem „endlos“ erscheinenden Strang vorgelegt und brauchen nur abgearbeitet werden. Dadurch kann der Angestellte bzw. Manager nicht mehr ästimieren wie viel Arbeit er bereits erledigt hat und auch wie viel Arbeit noch bevorsteht. Das „Einteilen Verhalten“, welches Teil des Parkinson’sche Gesetz ist verschwindet und kann somit nicht mehr greifen.\n3.\tBei jeder sich zeitlich abschätzbaren Aufgabe bekommt der Angestellte seine Bestzeit angezeigt. Hierdurch gibt es für den Angestellten eine zusätzliche Motivation. Er kann mit sich selbst in Konkurrenz treten und versuchen seine Bestzeit zu schlagen. Gleichzeitig gibt diese Anzeige dem Angestellten einen Rahmen vor, anhand dem er selbst besser einschätzten kann, inwieweit er noch konzentriert arbeitet.\n4.\tDurch die Interfaceanpassung aus Punkt 2 fällt zusätzlich einer der hinderlichsten Effekte des Arbeitens, sogenannte Rüstzeiten, weg. Rüstzeiten entstehen durch Taskswitching, welches durch das Wechseln von Tool zu Tool entstehen. Die daraus resultierende Anstrengung fällt weg. Die Frage nach mit welchem Tool und wo das Tool sich befindet mit dem man die Aufgabe löst entfallen. Durch eine Umstrukturierung in ein Feed-Interface, bei dem sich die Tools in der benötigten Reihenfolge selbst stapeln ist dieses Wissen nicht mehr oder zumindest deutlich weniger notwendig, wodurch der sogenannte „Flow-Zustand“ erhalten bleibt.\n5.\tDurch die, wie in späteren Kapiteln erklärte, Beteiligung an den Einnahmen durch die Verwendung, der Software, entsteht ein weiterer Anreiz so viele Arbeitsschritte wie möglich abzuschließen. Hierbei sind die einzelnen Einnahmen recht gering, welches aber in Studien, in Bezug auf Micropayments, gezeigt wurde deutlich besser funktioniert als große Zahlungen, da es nicht die intrinsische Motivation ersetzt, sondern lediglich ergänzt.\nBesonders die Kombination aus Punkt 1 und 2 führen auf Dauer dazu, dass die Aufgaben, die manuell bearbeitet werden müssen, reduziert werden bzw. diese auf kleinere besser verteilbare und mental weniger belastende Aufgaben heruntergebrochen werden. Dadurch wird die „Mentalload“ reduziert und es ist deutlich weniger zu erwarten, dass der Bearbeiter diese Aufgabe „vor sich herschiebt“ bzw. nach Erledigung eine größere Pause braucht. Wahrscheinlicher ist, dass ein „das kann ich jetzt noch schnell machen“ Effekt eintritt, der bei kleinen Aufgaben, die einen übersehbaren Bearbeitungshorizont haben, entsteht."
    },
    {
        "chapter_title": "NADOO IT: SOFTWARE",
        "chapter_content": ""
    },
    {
        "chapter_title": "WAS UNTERSCHEIDET NADOO IT SOFTWARE PROZESSE VON ANDEREN LÖSUNGEN?",
        "chapter_content": "Zunächst ist wichtig zu erkennen, dass alle bereits bestehenden Unternehmen auch schon bereits über die „Tools“ notwendig für Ihre Geschäftsprozesse verfügen. Das können spezielle Tools sein, Excel Listen, E-Mail-Vorlagen usw. aber auch Personen, die über das bestimmtes nicht niedergeschriebenes Wissen verfügen. \nWas viele Unternehmen falsch verstehen bzw. Softwareverkäufer Unternehmen versuchen zu erklären ist der Gedanke, dass Ihnen X Software noch fehlt und wenn Sie diese umsetzen, dann Erfolg haben werden.\nDieser Gedanke führt nur zu folgenden Situationen\n1.\tBereits bestehende Geschäftslogik, die den Angestellten klar und bekannt ist, wird in ein System übertragen, das Ihnen neu ist, das anders strukturiert ist und schlimmstenfalls Prozesse, die selbst entwickelt wurden und gute Ergebnisse gebracht haben nicht mit abdecken\n2.\tNeue Geschäftsprozesse werden zu den bereits bestehenden hinzugefügt und führen dazu, dass noch mehr Arbeit pro Auftrag notwendig ist. Diese Mehrarbeit kann dann potenziell durch zusätzliche Programmierung wieder ausgeglichen werden, wodurch wiederum zusätzliche Kosten für den Kunden entstehen. Der Kunde versucht dadurch aber in diesem gesamten Prozess zurück zu seinem vorherigen Status Quo zu kommen, anstelle einer echten Verbesserung zu erreichen\n3.\tEs entsteht eine sehr enge und nur schwer, wenn nicht unlösbare Bindung an ein Tool, über das der Kunde keine Kontrolle mehr hat und so dem Hersteller ausgeliefert ist\nDiese Effekte werden meist durch hübsche Bedienoberflächen und Geschichten, wie alles ja so großartig laufen könnte, verschleiert. Der Moment, in dem diese Probleme dann wirklich offensichtlich werden, ist meist an einem so späten Zeitpunkt im Umstellungsprozess, dass der Kunde bereits im System gefangen ist und das Ausgliedern aus diesem Prozess sehr teuer wäre. Andere Softwareunternehmen können sich diese Vorgehensweise leisten, da die Verantwortung den „versprochenen“ Effekt der Software zu erreichen, beim Kunden selbst liegt. \nSie können mittels: \n„Wenn Sie das System sowie von uns angegeben umsetzten, dann sehen Sie auch den versprochenen Effekt“ \ndie Verantwortung auf den Kunden abwälzen.\nDas ist unmöglich im NADOO System, da der Kunde nur für messbare Effekte zahlt und NADOO IT die Umsetzung aller dieser Schritte durchführt. \nDer Kunde kann nur den versprochenen Effekt erhalten, da er nur genau für diesen bezahlt. \nDas ist was die Produktivität Garantie garantiert. \nGleichzeitig ist NADOO IT nicht gebunden an den Verkauf seiner Software, denn es wird keine Software verkauft! Sollten die NADOO IT Mitglieder eine Software kennen, die nicht von NADOO IT Mitgliedern entwickelt wurde, kann diese dennoch eingesetzt werden, solange die Software das Resultat erbringt und rechtliche Vorgaben erfüllt. Das ist auch der Grund wieso im Prozess des NADOO Systems Datenbanken so gestaltet werden, dass ein schneller Wechsel zwischen verschiedenen Tools so leicht wie nur möglich gestaltet und die Bindung an ein bestimmtes Tool weitgehend vermieden wird. Dadurch sind die Systeme schnell austauschbar und der Kunde bekommt den Effekt, für den er tatsächlich bezahlt."
    },
    {
        "chapter_title": "WAS SIND DIE PHASEN DER UMSTRUCKTURIERUNG VON GESCHÄFTSPROZESS-SOFTWARE?",
        "chapter_content": "Um die im vorherigen Abschnitt beschriebenen Ziele zu erreichen, wird das Umstellen nicht in einem großen Schritt, sondern in vielen kleinen Schritten vollzogen. Diese inkrementale Anpassung der Prozesse ist entscheidend, um die Mitarbeiter des Kunden mit einzubinden und den Übergang in einem für Sie passenden Tempo zu vollziehen. Dies ist notwendig, da sonst bei den Mitarbeitern sowohl ein Gefühl von Überforderung und des übergangenen Werdens aufkommen kann. Hierdurch werden die Angestellten stattdessen ein Teil des Verbesserungs-Teams. Der Prozess der Automatisierung ist weitgehend immer gleich, soweit das verwendeten Tools über Programmierbarkeit bzw. Schnittstellen, verfügen.\nDadurch ergibt sich ein anderes Bild über die Produktivitätsveränderung im Vergleich zur Konkurrenz. Anstelle das Berater Angestellte belehren, wie die von Ihnen verkaufen Systeme zu verwenden sind, werden die Angestellten zu den Beratern und erklären den Entwicklern wie Sie Ihre Arbeit machen.\nBeginnen wir zunächst mit einem Vergleicht zu einem System wie SAP. Einige Unternehmen haben in den letzten Jahren SAP eingeführt. Bei dieser Einführung kann es mitunter fünf und mehr Jahre dauern, bis die Umstellung vollzogen ist. Aus persönlicher Erfahrung und auch der anderer, sind selbst nach dieser „Umstellung“ immer noch viele Betriebsprozesse nicht in SAP abgebildet. Stattdessen werden Daten aus SAP entnommen, verarbeitet und die Ergebnisse in SAP eingepflegt. Dies kann auch daran liegen, dass viele der Funktionen von SAP unbekannt sind und den Nutzern unklar ist wie Sie sie einsetzen sollen. Das Versprechen von SAP ist, dass nach einer Investitionen Phase, in der die Daten und Strukturen eingeführt werden, ein, sobald aktiviert, starker Produktivitätszuwachs einsetzt. Tatsächlich ist dies aber nicht garantiert und es besteht das Risiko, das diese Umstrukturierung zu vielen negativen Effekten führt und selbst „nach“ der Umstellung immer noch alte Systeme weiter betrieben werden, da unklar ist wie manche Aufgaben in SAP bearbeitet werden sollten. Auch kann durch den hohen Investitionsbedarf in dieser Phase es zu so hohen Belastungen kommen, dass für andere Bereiche im Unternehmen kein Budget mehr zur Verfügung steht oder sogar Kürzungen in kritischen Bereichen notwendig werden. Es ist zwar während des Umstellungsprozesses möglich teilweise bereits Module von SAP einzusetzen, jedoch wird hierbei sowohl Beratung, Schulung und Betreuung notwendig. Ob die durch SAP möglichen Produktivitätssteigerungen wirklich einsetzen und wann sich diese für den Unternehmer bzw. das Unternehmen lohnen, ist hier vollkommen unklar. Viele auch größere Unternehmen sind an der Einführung von SAP gescheitert. Hier eine kleine Liste von Unternehmen, die SAP versucht haben umzusetzen und wenn bekannt der dabei entstandene Verlust:\nOtto beendete sein SAP-Projekt 2012. Nachdem es für mehr als 3 Jahre das größte IT-Projekt des Unternehmens war.\nDie Deutsche Bank stoppte 2015 die Einführung von SAP, nachdem es mehr als eine dreistellige Million Summe verschlungen hatte.\nDie Deutsche Post endete seine Einführung 2015 mit rund 308 Millionen Euro kosten für die „Einführung“ und nochmal 37 Millionen für die Rückführung.\nEdeka startete seine Umstellung auf SAP 2007 mit einem Budget von 200 Millionen Euro. Das Projekt war 2012 abgeschlossen und kostete tatsächlich 350 Millionen.\nDer Konkurrent Lidl startete 2011 sein SAP Einführungsprojekt und nach fast 7 Jahren und einer halben Milliarden Euro Investition wurde das Projekt gestoppt, mit der Aussage „die ursprünglichen Projektziele seien „nicht mit vertretbarem Aufwand“ erreichbar“\t\t Quelle: SAP: Gefloppte Projekte bei Haribo, Lidl, Otto & Co. (wiwo.de)\nDagegen ist der Prozess deutlich anders im NADOO System. \nDadurch, dass im NADOO System nur für Produktivitätssteigerung gezahlt wird, ist dieser Punkt schlicht weg unmöglich. \nGleichzeitig sind solche allumfassenden mit langen Vorlaufszeiten, große Investitionen, hohem Personalbedarf verbundenen und „Revolutionären“ Umstellungen zu Beginn des Prozesses unwirtschaftlich für NADOO. Weder für den Kunden, der jetzt Verbesserung braucht, noch für NADOO das Jetzt anfangen will Einnahmen zu generieren sind solche Umstände wirtschaftlich interessant. Dementsprechend sind die Berater bzw. Entwickler Teams im NADOO System darauf bedacht schnell kleine und gut automatisierbare Aufgaben zu finden und hierfür Tools bereitzustellen. Auch, um aufwendige Schulung und kostspielige Betreuung zu vermeiden, da für die im NADOO System keine Zahlung vorgesehen sind, muss Software so selbsterklärend wie nur möglich sein. Durch diese Form der Umstellung erhält der Kunde nach kürzester Zeit bereits seine ersten Automatisierungen und kann Verbesserungen in seinem Unternehmen messen. Er erhält schnellstmöglich Erleichterung und die Möglichkeit sich mehr auf seine Unique Selling Points zu konzentrieren und mehr Umsatz zu generieren."
    },
    {
        "chapter_title": "WAS SIND DIE PHASEN DER UMSTRUCKTURIERUNG VON GESCHÄFTSPROZESS-SOFTWARE? PHASE 1",
        "chapter_content": "Die Hauptzielgruppe ist Unternehmen, die größtenteils mit Office Produkten arbeiten bzw. Ihre Prozesse noch nicht digitalisiert haben. Der folgende Prozess lässt sich weitgehend auf alle Arten von Unternehmen anwenden.\nIn Phase 1 des Automatisierungsprozesses wird der grobe Ablauf des Betriebs von Auftragseingang bis zur Rechnungsbezahlung erfasst. Hierbei wird besonders darauf abgezielt alle Dokumente, mit denen während dieser Prozesskette gearbeitet wird zu erfassen. Der Fokus liegt hier zu erfassen in welchen Dokumenten welche Daten erfasst werden und wie und von wem diese Daten verarbeitet werden.\nNachdem diese grobe Prozessstruktur erfasst wurde, wird ein Bereich, vorzugsweise der Begin, ausgewählt und Tools zur besseren Erfassung der Kundendaten angefertigt. Hierdurch wird der Prozess deutlich verbessert und gleichzeitig ermöglicht dies für spätere Arbeitsschritte eine bessere Zu­or­den­barkeit zu einem bestimmten Kundenauftrag. Dies ist besonders wichtig, da wie bereits erklärt wurde, Programmausführungen nur einmal pro Auftrag berechnet werden sollen. Um dies zu ermöglichen ist jedoch diese Zuordenbarkeit vorausgesetzt. Solange dies nicht gegeben ist, werden alle Ausführungen berechnet.\nMithilfe von Tools werden die Daten aus den vorhandenen Quellen in Datenbanken übertragen. Hierdurch entsteht die Möglichkeit später diesen Startprozess schnell in ein Webtool umzuwandeln und die Daten in anderen Tools/Listen zur Verfügung zu stellen.\nDiese Einbindung ist zunächst in allen Listen bzw. vom Kunden verwendeten Tools umzusetzen. Durch diese Anpassung werden die Daten von den Dokumenten und damit dem Interface separiert.\nDies ist eins der wichtigsten Arbeitsschritte, da Excel Dokumente eines der Regeln der Softwareentwicklung brechen. In Excel Dokumenten sind sowohl die Bedienungsoberfläche, also wie mit den Daten interagiert wird, die Logik wie diese Daten verarbeitet werden und der Speicher Ort der Daten an einem Ort zusammengeführt.\nIn der Softwareentwicklung ist die Regel, dass alle diese drei Bausteine voneinander getrennt werden sollten. Dafür gibt es eine Vielzahl von Gründen.\n1.\tDurch die Trennung ist es möglich die Bedieneroberfläche anzupassen und so einen angenehmeren und potenziell effektivere Anwendungssteuerung zu ermöglichen.\n2.\tDurch einen Hackerangriff oder durch den Ausfall der Hardware, sind die Daten nicht verloren und ein aufwendiges Wiederherstellen kann vermieden werden.\n3.\tDaten sind nicht an mehreren Orten zu pflegen und liegen zentral zur Verfügung und können an anderen Orten abgerufen werden.\n4.\tDie Logik kann wiederverwendet werden und sollte sich diese ändern ist diese Änderung nicht an mehreren Orten durchzuführen. Auch werden so die Zusammenhänge dieser Logik überschaubar.\nEin weiterer Teil dieses Schrittes ist die optionale Überführung von Windows Office zu LibreOffice. Eine OpenSource Lösung, die eine deutlich bessere Integration mit der verwendeten Programmiersprache Python ermöglicht aber vor allem deutlich weniger anfällig für Virenangriffe und kostenlos ist.\nIst das Trennen von Benutzeroberfläche, Daten und Logik für eine der verwendeten Dokumente abgeschlossen beginnt für diesen Prozessschritt Phase 2"
    },
    {
        "chapter_title": "WAS SIND DIE PHASEN DER UMSTRUCKTURIERUNG VON GESCHÄFTSPROZESS-SOFTWARE? PHASE 2",
        "chapter_content": "Nachdem in Phase 1 eines der genutzten Dokumente in eine „Insellösung“ umgewandelt wurde, beginnt der nächste Schritt.\nIn diesem wird dem Kunden angeboten Office zu verlassen und die Funktionalität in ein Webtool zu übertragen. Stimmt dieser zu, wird ein Webtool und somit, wenn sinnvoll, eine App erstellt.\n Für die Überführung von Office zu Webtools gibt es eine Vielzahl von Gründen:\n-\tWebtools benötigen keine Installation was das Onboarding von neuen Nutzern erleichtert\n-\tWebtools sind keine Office Dokumente die Opfer von Hackerangriffen werden können\n-\tWebtools sind in den meisten Fällen deutlich schneller als Office Dokumente\n-\tWebtools können leichter um komplexe Funktionalität erweitert werden, da Ihr Interface frei gestaltbar ist\n-\tWebtools sind deutlich performanter unabhängig von der Nutzerhardware, was günstigere Endgeräte ermöglicht (Siehe Phase 3)\n-\tWebtools lassen sich leichter testen. Es ist z.B. möglich mit Testdaten anstelle der Produktivdaten zu arbeiten und somit nicht den aktiven Prozess zu stören.\n-\tWebtools ermöglichen deutlich leichter A/B Test. Also Tests in denen unterschiedliche Konfigurationen der Benutzeroberfläche miteinander verglichen werden können, um zu ermitteln welches den größten Nutzen bzw. nutzerfreundlicher ist.\n-\tWebtools ermöglichen einen hohen Grad an Modularität. Dadurch können verschiedene Elemente eines Tools separat voneinander entwickelt und verbessert werden. Auch können neue Funktion schneller hinzugefügt werden und wiederverwendet werden.\nEs gibt noch viele weitere Vorteile auf die hier nicht eingegangen wird. \n\nDie Überführung der Office Anwendung in Webtools führt dazu, dass nach einer absehbaren Zeit alle Arbeitsschritte über klar definierte und auf die Anwender hin optimierte Schaltflächen umgesetzt werden."
    },
    {
        "chapter_title": "WAS SIND DIE PHASEN DER UMSTRUCKTURIERUNG VON GESCHÄFTSPROZESS-SOFTWARE? PHASE 3",
        "chapter_content": "Wichtig ist zu verstehen das alle bis jetzt genannte Phasen gleichzeitig stattfinden. Das Phasenmodell bezieht sich weitgehend nur auf einen einzelnen Prozessschritt und nicht auf die Gesamtheit des Projektprozesses. Es ist nicht notwendig für alle Prozesse zunächst Phase 1 abzuschließen, um mit Phase 2 zu beginnen. Je nachdem, was für Programme vom Kunden genutzt werden, kann eventuell sogar Phase 1 übersprungen werden.\nEs ist eines der Hauptziele der ersten beiden Phasen, die Möglichkeit zu schaffen ein „Projekt“ oder „Auftrag“ über den gesamten Bearbeitungsprozess zu erfassen. Dadurch entsteht nicht nur die Möglichkeit zu überwachen, wie weit einer dieser im Ablauf ist, sondern auch einen strukturierten Ablauf für diese zu erstellen.\nIn Phase eins bestand ein Großteil der Aufgabe daraus die Informationen über welche Tools mit welchen anderen verknüpft sind zu erfassen, Phase 2 die Möglichkeit eine flexible und Situationsabhängige Arbeitsabfolge zu schaffen, während Phase 3 darauf abzielt, die Information über die Schrittfolge und Entscheidungsfindung bezüglich der Projekte zu erfassen.\nDadurch wird es möglich einen Aufgaben Stapel für jeden Auftrag zu erstellen, der dann automatisch mit nur minimalen Benachrichtigungen (E-Mail oder sonstige Kommunikation) bearbeitet werden kann.\nAuch wird es möglich bei Veränderungen zum Beispiel durch Anpassung von Kundendaten schnell an den Punkt im Projektverlauf, an dem diese Informationen verarbeitet werden, zu springen und dann eine Liste der Arbeitsschritte zu erstellen, die durch diese Änderung angepasst werden müssen. Somit kann verhindert werden, dass bei einer Änderung bestimmte Abteilungen nicht informiert werden und so sich Fehler in den Bearbeitungsprozess einschleichen.\nGleichzeitig wird, nachdem der Projektprozess erfasst ist, es deutlich leichter statistische Informationen zu erheben und so dem Kunden Angaben zu erwarteter Dauer bis zur Vertragserfüllung zu geben.\nIst der Kunde in Phase 3 angekommen und alle seine Prozesse somit digitalisiert wird damit begonnen die Arbeitsschritte in mehr und deutlich kleinere zu zerteilen. So kann es z.B. sein das an mehreren Punkten im Projektprozess Kundendaten erhoben werden. Diese Erhebungsprozesse werden dann aus Ihren alten Positionen entkoppelt und zusammengefasst. Gleichzeitig kann in dieser Phase hinterfragt werden, wie eben solche Daten erhoben werden. So könnte es sein, dass diese Kundendaten vom Kunden selbst erhoben werden können, wenn diesen genügend Informationen zur Verfügung gestellt wird, wie er dies tun kann. \nHierzu mehr im Kapitel „DER EFFEKTIVESTE WEG DER INFORMATIONSERHEBUNG“\nIn Phase 3 wird hauptsächlich der Informationsfluss neu strukturiert und dafür gesorgt das Aufträge „Im Fluss“ bearbeitet werden. Hierdurch fallen die Kosten, die beim Wechseln von einem zu einem anderen Auftrag entstehen weg und Projekte werden deutlich fehlerfreier abgearbeitet.\nSind die meisten Arbeitsschritte so übertragen und somit bereits ein hoher Grad an Automatisierung entstanden, werden auch sehr kurze Geschwindigkeitssteigerungen bedeutend. Ab diesem Punkt wird den Kunden auch angeboten den Hardwareteil Ihres Unternehmens an NADOOIT abzugeben. Dabei ist die Bereitstellung der Hardware kostenlos und stattdessen werden die Kosten für die Hardware, genauso wie bei der Software, über tatsächliche Effektivitätssteigerung berechnet. Dazu gehört auch, dass sollte eines der Geräte ausfallen, die Zeit die dadurch verloren geht gutgeschrieben wird.\nDadurch wird alles was mit IT zu tun hat aus den Unternehmen entfernt und optimiert anhand einer im Interesse des Kunden liegenden Metrik. So wird es dem Unternehmen möglich risikofrei ROI zu erzeugen."
    },
    {
        "chapter_title": "WAS SIND DIE PHASEN DER UMSTRUCKTURIERUNG VON GESCHÄFTSPROZESS-SOFTWARE? PHASE 4",
        "chapter_content": "Zu Beginn von Phase 4 sind die Arbeitsschritte und damit der Projektprozess vollständig erfasst. Aufgaben werden den einzelnen Angestellten ohne jede Form von Management direkt anhand Ihrer Fähigkeiten und nach Ihrer derzeit optimalen Priorität zugewiesen. Aufgaben werden in einem Feed direkt untereinander angezeigt (Beispiele wäre hier Twitter, YouTube oder andere Socialmedia Feeds). Hierdurch fällt das Wechseln zwischen verschiedenen Tools vollständig weg und die Verknüpfung von Arbeitsschritt -> Tool oder Dokument wird vollständig aufgehoben. Der Bearbeiter braucht sich selbst keine Gedanken mehr über die Priorisierung von Aufgaben machen. Somit wird der Fokus vollständig auf die Fähigkeiten des Bearbeiters verschoben und weg von dem Wissen über welches Tool für was ist. Dieser Wechsel ist wichtig da es das Anlernen von neuen Angestellten erleichtert. Neuen Angestellten kann eine bestimmte Aufgabengruppe zugewiesen werden und Sie brauchen lediglich Ihren Aufgabenfeed öffnen und abarbeiten. Zu dieser Aufgabe liegen Ihm/Ihr sowohl Schulungsunterlagen als auch Hilfstools in Form der Programme zur Verfügung, die das Anlernen erleichtern. So wird das direkte Bearbeiten von Aufgaben direkt zu einem Training, bei dem alle Informationen bzw. Methoden zu dessen erlernen bereit liegen oder auch einen Mentor dazu geholt werden kann.\n \nIn Phase 4 wird es möglich durch die vollständige Erfassung der Prozessschritte die Informationen/Daten auch komplexere Aufgaben mithilfe von künstlicher Intelligenz vollständig oder zumindest weiter zu teilautomatisieren. Ab diesem Punkt wandert der Fokus der Angestellten bzw. der Anwender immer weiter auf das Verwalten und Überprüfen der von künstlichen Intelligenzen verarbeiteten Informationen. Sie prüfen ob die Ergebnisse korrekt sind und führen notwendige Änderungen aus und trainieren so die künstlicher Intelligenz weiter, um auf lange Sicht diese künstlicher Intelligenz an einen Punkt zu bringen an dem die künstlicher Intelligenz genauso gut oder besser als der Anwender die Aufgabe ausführen kann."
    },
    {
        "chapter_title": "WAS SIND DIE PHASEN DER UMSTRUCKTURIERUNG VON GESCHÄFTSPROZESS-SOFTWARE? PHASE 5",
        "chapter_content": "Während Phase 4 läuft, beginnt während des Trainingsprozesses der künstlichen Intelligenz auch Phase fünf. Dadurch das die Angestellten mithilfe der künstlichen Intelligenzen eine Bearbeitungsgeschwindigkeit erreichen, dass diese den gesamten Arbeitsvorrat für Ihren Arbeitgeber in kürzester Zeit bearbeiten können, wird dem Kunden die Option gegeben diesen Arbeitsschritt vollständig auszulagern und in einen Dienst, der auch an „Konkurrenten“ bzw. andere Mitglieder des Netzwerkes ausgeliehen werden kann, umzuwandeln. Angestellte steht ab diesem Punkt die Option frei die von Ihnen gelernten Fähigkeiten auch bei anderen Unternehmen einzusetzen. Dadurch ergeben sich mehrere Vorteile. \nAngestellte sind für Ihre Arbeit nicht mehr an einen Arbeitgeber gebunden. Selbst wenn dieser Arbeitgeber wieso auch immer insolvent, verkauft oder aus sonst einem Grund aufhören sollte zu existieren, dies nicht mehr dazu führt, dass dieser einen neuen Arbeitgeber suchen muss. Angestellte können frei bei verschiedenen Arbeitgebern arbeiten und so sowohl Ihr Einkommen als auch sonstige Konditionen optimieren. Tatsächlich entsteht so aber eine höhere Betriebszugehörigkeit, da die Notwenigkeit zu wechseln deutlich geringer wird.\nFür Arbeitgeber entstehen ebenfalls viele Vorteile. Einer der größten Vorteile ist, dass sich Ihr Geschäft frei skalieren lässt. Sie können so viele Projekte wie Sie möchten annehmen, da sollten Sie mehr Anfragen haben als Sie normalerweise mit Ihren Angestellten bearbeiten könnten, die Möglichkeit besteht freie Mitarbeiter für diese Projekte hinzuzufügen, ohne das zusätzliche Schulungen auf Ihrer Seite notwendig sind. Die typische Anlernphase für neue Angestellte fällt vollständig weg, da durch die Tools und das Aufbrechen der Aufgaben in viele kleine Schritte, die mit ausführlichen Schulungsinformationen versehen sind, es möglich wird selbst für Jemanden, der diese Arbeit zuvor noch nie ausgeführt haben sollte, dies in kürzester Zeit zu erlernen.\nSollte der Arbeitgeber sein Stammpersonal ausbauen wollen, kann er dies auf der Plattform ausschreiben. Potenzielle neue Angestellte können, anstelle durch einen langwierigen Bewerbungsprozess zu gehen, bereits erste Arbeiten erledigen, für die Sie natürlich auch entlohnt werden, und so Ihr Können beweisen. Dadurch erhalten Arbeitgeber neue Angestellte, die bereits vertraut sind mit ihren Arbeitsprozessen bzw. bewiesen haben, dass Sie dazu in der Lage sind die vom Arbeitgeber gewünschten Arbeitsschritte zu lösen. \nHier durch verschiebt sich der Fokus der Personal Abteilung.\nWährend zuvor die Aufgaben der Personal Abteilung vor allem daraus bestand neue Angestellte zu finden und potenziell neue Angestellte zu bewerten, auch wenn dem Personal der HR das Fachwissen fehlt, um diese Bewertung durchzuführen, ist nach der Umwandelung die Hauptaufgaben ein Verwaltungsauftrag und die Pflege der bestehenden Angestellten. Ihre Hauptaufgabe ist es nun dafür zu sorgen, dass sich die Angestellten maximal wohl im Unternehmen fühlen und die Angestellten mental und körperlich gesund sind."
    },
    {
        "chapter_title": "NADOO IT: SOFTWAREARCHITEKTUR",
        "chapter_content": "Alle Software wird im Verlauf der Automatisierung in sogenannte Microservices umgewandelt. So bildet jeder Prozessschritt ein vollständig losgelöste Softwarelösung, die dann auch potenziell bei anderen Kunden eingebunden werden kann. Durch diese Art der Strukturierung können die einzelnen Prozesse von kleinen und unabhängigen Teams entwickelt und gewartet werden. Iteration wird so gefördert und Abhängigkeiten vermieden.\nIm Gegensatz zu Standard-Software werden Programme nicht in einzelnen Transaktionen strukturiert, sondern in einer Kette von Aktionen. Jedes Programm repräsentiert einen Arbeitsschritt und dessen Vorläufer und Nachgänger.\nEs gibt eine Übersicht, auf der alle derzeitigen Projekte und die dazugehörigen Aufgaben gezeigt werden und der Punkt, an dem sich das Projekt in der Prozesskette von Auftragseingang bis Auftragsfertigstellung befindet.\nWird das Projekt ausgewählt, wird der derzeitige Arbeitsschritt und somit das Programm dafür geöffnet. Jedes Programm kommt mit klaren Schrittfolgen (Schritt zuvor, Schritt danach) und Dokumentation, die einen dabei unterstützen die Aufgabe zu erledigen. Es gibt FAQ zu jedem Schritt und eine Liste von bekannten Problemen. In der Dokumentation ist festgehalten woher die Informationen, die angezeigt werden, stammen (Datenfluss) und wie vorgegangen werden muss sollten sich Daten ändern. So ist der Bearbeiter immer im Klaren darüber, wie er in Sondersituationen reagiert und die Gefahr von Überforderung wird vermieden.\nIm NADOO System wird es viele Module (Software) geben, die dauerhaft frei verfügbar sind.  Diese Software entsteht durch Angrenzen an Tools für die Prozessautomatisierung. Die Prozessautomatisierungen finanzieren das notwendige Budget für deren Entwicklung und Wartung. So werden auch Utility Tools entwickelt, die selbst keine oder nur minimale Auftragsbearbeitungsszeitreduktion bedeuten. Durch diese kann es zu Netzwerkeffekten kommen, die das Gesamtsystem verbessern. \nEs steht auch jedem Tool frei sich aus dem NADOO System zu entkoppeln und eine prioritäre Variante zu verkaufen. Die Kerntools stehen mit Ihrem Quelltext offen und dürfen sowohl unter neuem Namen weiterentwickelt bzw. auf die individuellen Bedürfnisse hin angepasst als auch verkauft werden. Wichtig ist lediglich, dass bereits bestehende Beschleunigungserfassungen nicht entfernt werden dürfen und das Sicherheitsupdates auch in das Basistool zu übertragen sind. \nExterne Teams können neue Features oder kosmetische Anpassungen verkaufen. So könnte z.B. ein spezielles Design, der vom Kunden gewünscht wird, auch außerhalb des NADOO Systems entwickelt und vertrieben werden.\nUm zu verhindern, dass NADOO-Dienste von zentralen Serverstrukturen abhängig sind, arbeiten wir mit Peer-to-Peer (P2P)-Technologie. Diese ermöglicht es, dass Endgeräte unserer Kunden direkt miteinander kommunizieren können, ohne den Umweg über einen Server. Dadurch ist es niemandem möglich, die zwischen den Nutzern ausgetauschten Daten einzusehen. Dank dieser Technologie skaliert das System mit dem Wachstum des Kunden. Jedes neu hinzugefügte Gerät erhöht die Rechenleistung und Speicherkapazität. Daten werden auf mehreren Geräten sicher gespeichert, was Backups überflüssig macht und das System selbst in Katastrophenfällen stabil hält. Im NADOO-System sind Daten und Software immer verfügbar und können von niemandem, auch nicht von NADOO selbst, gelöscht oder unterbrochen werden. Zudem können alle Kunden und Nutzer innerhalb und außerhalb von NADOO eigene geschlossene Netzwerke erstellen. So bestimmen sie selbst über die Datenhoheit und den Zugang zu ihren Systemen und Daten, unabhängig von NADOO."
    },
    {
        "chapter_title": "NADOO IT: DATENERFASSUNG",
        "chapter_content": "Eins der Schlüsselaufgaben vom NADOO System ist es so schnell wie möglich jegliche Form von Papier aus den Arbeitsprozessen zu entfernen. Daten auf Papier sind schlecht für digitale Prozesse und ein Übertragen von Informationen von Papier zu Digital zeitaufwendig und fehleranfällig. Diese Daten sind auch entscheidend für das Trainieren der Künstlichen Intelligenzen und müssen dementsprechend digitalisiert vorliegen. Somit besteht eins der ersten Ziele darin alle regulär vorkommenden Datenerfassungspunkte durch Formulare, die aus einzelnen Informationsfeldern bestehen, zu erfassen. Diese Formulare werden im Verlauf der Digitalisierung immer näher an die Informationsquelle gebracht. So mag es sein, dass zu Beginn des Prozesses, viele der verarbeiteten Informationen noch durch Sach- oder Facharbeiter erfasst werden. Nachdem die Datenpunkte in Formularen erfasst sind, werden genaue Anleitungen und Unterstützungstools erstellt, durch die der Kunde weitgehend selbst in der Lage sein sollte, die notwendigen Informationen zu erheben und direkt in die Formulare einzutragen. Die Aufgabe des Sach- und Facharbeiters liegt dann darin die übermittelten Informationen auf Korrektheit zu prüfen und die eventuellen Fehler zu beheben. Anhand der sowohl als korrekt und auch fehlerhaft erkannten Datenpunkten, werden dann Künstliche Intelligenzen trainiert, die dann in Zukunft Kunden wiederum bei Fehlern auf diese hinweisen kann und die Erhebung deutlich erleichtern.\nAll diese Schritte geschehen während des normalen Arbeitsprozesses und haben nur minimale zeitliche Auswirkungen. Die Angestellten arbeiten wie gewohnt weiter und werden lediglich während der Erfassungstermine nach Ihrem Entscheidungsbildungsprozess gefragt."
    },
    {
        "chapter_title": "DER WEG ZU BESSERER INFORMATIONSERHEBUNG",
        "chapter_content": "Dank des Produktivitätsmodells ist das Ziel von NADOO IT die Geschwindigkeit der Informationserhebung erheblich zu steigern. \nIn regulären Prozessen findet dies meist in mehreren Phasen statt. \nPhase 1: \nFrage Aufstellen was für Daten für den entsprechenden Kunden erfasst werden müssen\na.\tDies wird durch die klare Struktur des NADOO Systems vermieden oder weitgehendst reduziert\nPhase 2:\nQuelle für Informationen ermitteln\nb.\tAuch hier wird über die Dauer nach und nach jede dieser Quellen erfasst und schneller angesteuert. Egal ob die Quelle Text, Bilder, Video oder Tonaufnahmen bedeuten\nPhase 3:\n\nAnfragen von Information\n\n\n\n\n\nDER VERGLEICH:\nVOR NADOO IT: \n1.\tKunde wendet sich mit Anfrage an Sacharbeiter \n2.\tErste Informationen werden beim Kunden angefragt\n3.\tKunde geht die Informationen sammeln\n4.\tRichtet sich wieder an Sacharbeiter\n5.\tDer Sacharbeiter erfasst dann die Antwort als Notiz oder Erinnerung und weist den Kunden auf möglicherweise fehlende Informationen hin, die noch benötigt werden\n6.\tKunde geht die fehlenden Informationen sammeln\n7.\tKunde wendet sich wieder an Sacharbeiter\n8.\tWiederhole alle Schritte von 5 an, bis alle Informationen zusammengetragen sind\n9.\tInformationen werden aus diesen Notizen oder Erinnerungen in ein System eingetragen\nDie Schlüsselprobleme mit dieser Prozesskette sind:\n1.\tKunde weiß zu Beginn des Prozesses nicht welche Daten von Ihm verlangt werden bzw. was er genau kaufen sollte, und benötigt einen Beratungsprozess\n2.\tKunde weiß nicht, wie er korrekt die Daten erfassen soll was zu Fehlern führen kann und beim Kunden Unsicherheit auslösen kann, was wiederum eine schlechte Kundenerfahrung bedeutet\n3.\tKunde nimmt viel Zeit eines Sacharbeiters in Anspruch und führt so zu vielen „Rüstungskosten“ wie z.B. wiederholte Begrüßungen und Verabschiedungen, Nachfragen usw.\n4.\tBeim Übertragen der Information aus dem Kundengespräch können sich Verständnisprobleme, Tippfehler oder kurzzeitige Aussetzer der Erinnerung einschleichen, was ein Nachfragen durch den Sacharbeiter beim Kunden bedeuten würde, was wiederum die Kundenzufriedenheit schädigen könnte.\n5.\tDas Übertragen von Daten in das System erfordert Zeit\n\nNACH NADOO IT:\nEs ist das generelle Ziel die Erhebung der Daten so nahe wie möglich an deren Quelle zu bringen. So können, die oben beschriebenen Unterhaltungen und Rückfragen vermieden werden. Wiederum kann das Eintragen von Daten reduziert werden, indem diese Daten direkt aus den Tonaufnahmen des Dialogs zwischen Sacharbeiter und Kunden, dank moderner NLP-Systeme, erhoben werden. Der Sacharbeiter braucht lediglich die richtige Frage stellen und das System erfasst die Antworten. \nHier wird es später auch möglich sein Chatbots, die von echten Menschen kaum zu unterscheiden sind, einzusetzen und so standardfragen zu bearbeiten und erst einen Sacharbeiter mit einzubeziehen, wenn dies absolut notwendig ist. So kann Arbeit in Verbindung mit Leads, die keine tatsächlichen Kunden werden vermieden werden. Durch dieses Verfahren entstehen dem Kunden keine Kosten, da nur für abgeschlossene „Projekte“ kosten entstehen. \nAuch werden dem potenziellen Kunden zur Beantwortung von notwendigen Fragen Lehrunterlagen gesendet, mittels derer er selbst in der Lage ist die Datenerhebung durchzuführen. Das erspart viel Zeit auf der Seite der Sacharbeiter und führt zu gut informierten Kunden, die in der Lage sind, in einem dennoch notwendigen persönlichen Gespräch, informierte Antworten zu geben. Somit sollte für die meisten Aufträge bereits der gesamte Auftragsannahmeprozess vollständig automatisiert sein und nur in Notfällen ein Sacharbeiter notwendig werden. Dadurch wird es dem Betrieb möglich seinen Auftragseingang zu steuern. Mittels Werbung können Aufträge bei Bedarf erzeugt werden und wenn nicht vermieden werden, ohne dass seine Sacharbeiter ohne Arbeit sind. Auch wird so sehr viel mehr Zeit für die Individuelle Beratung von tatsächlichen Kunden ermöglicht, was zu einer höheren Kundenzufriedenheit beiträgt.\nHierdurch entsteht folgender Prozess:\n1.\tKunde landet auf Informationsseite\n2.\tKunde informiert sich über die möglichen Produkte/Angebote\n3.\tKunde wählt Produkt oder Angebot aus\n4.\tKunde wird auf eine Seite weitergeleitet, auf der er notwendige Informationen eintragen kann, um ein Kundenkonto anzulegen (E-Mail) -> für spätere Werbung, andere Dienstleistungen\n5.\tKunde wird aufgefordert Informationen, die notwendig sind, um den Auftrag zu bearbeiten, bereitzustellen\na.\tKunde erhält für jedes Feld, das ausgefüllt werden soll, sowohl Beispiele als auch ein Video in dem erklärt wird, wo und wie diese Informationen erhoben werden können.\nb.\tKunde kann optional auch ein Robointerview durchführen in dem ein Chatbot diesem die Fragen stellt und die Antworten aus dem Gespräch entnimmt. Der Kunde kann dann nach dem Gespräch die Informationen prüfen\nc.\tBefinden sich diese Informationen in bestimmten Dokumenten oder können aus Bildern entnommen werden, erstellen wir die Möglichkeit die Dokumente per Foto zu erfassen. Sollte es sich z.B. um ein Gutachten handeln, wird es die Möglichkeit geben, ein Bild von der zu begutachtenden Situation zu machen und daraus automatisch die notwenigen Informationen zu erheben.\nSo beginnt jeder Auftrag, der nicht komplett vom normalen Produktkatalog abweicht, perfekt bzw. weitgehend perfekt vorbereitet. Sacharbeiter haben deutlich mehr Zeit sich um Kundenzufriedenheit und Verbesserungen zu kümmern als um Kunden-Akquise und Auftragsdatenerhebung.\nDieser Mechanismus lässt sich auch in vielen Punkten während des Prozesses wiederverwenden. So sollte es neue Daten benötigen können diese zunächst über die E-Mail erfragt werden und nur sollte der Kunde auf ein Telefonat bestehen ist ein Zeitinvestment des Sacharbeiters oder Facharbeiters notwendig."
    },
    {
        "chapter_title": "NADOO IT: WISSENSWEITERGABE UND MENTORING",
        "chapter_content": "Eins der Kernprobleme, die in fast allen Unternehmen herrscht, ist ein Mangel an Wissensweitergabe bzw. dass diese, zwischen bereits erfahren Personen passiert, wodurch viele Informationen, die für einen neuen Angestellten wichtig wären, verloren gehen. Da zur Erfassung und Erstellung der NADOO IT Tools zunächst Lehrunterlagen erstellt und im Verlauf der Verwendung erweitert werden entstehen so Lehrmaterialien, die für jeden zugänglich sind. Das Besondere ist das Experten einem Leihen Ihre Fähigkeiten vermitteln und Leihen dann die Unterlagen erstellen. Durch diese Vorgehensweise wird der Experten Effekt umgangen und stattdessen ein Zustand von Shoshin (Beginners Mind) erreicht. \nDer Experten Effekt ist die Annahme, das bestimmtes Wissen bereits bekannt sein sollte. Experten sind bereits so routiniert in Ihrer Aufgabe, dass bestimmte Arbeitsschritte nicht mehr als Arbeitsschritte erkannt bzw. wahrgenommen werden. Ein kompletter Laie wiederum ist an jedem Punkt des Prozesses ohne Wissen und benötigt ein hohes Maß an Aufmerksamkeit, um verstehen zu können was passiert. Aus diesem Grund stellt ein Laie etliche Fragen ohne Vorwissen, welches in den meisten Fällen kritische Entscheidungspunkte aufdeckt. \nUm den Erfassungsprozess noch weiter zu strukturieren und in ein einheitliches Format zu führen werden den Personen, die die Dokumentation erstellen ein Formular mit vordefinierten Fragen gegeben. \nFragen wie: \n•\tWas ist der Arbeitsschritt, den wir jetzt durchführen, hat er einen Namen?\n•\tWarum wird dieser Arbeitsschritt jetzt ausgeführt und nicht früher oder später?\n•\tWer hat denn Auftrag gegeben, dass dieser Arbeitsschritt jetzt ausgeführt wird?\n•\tWer wird benachrichtigt, wenn dieser Arbeitsschritt abgeschlossen ist?\n•\tWartet jemand auf diesen Arbeitsschritt oder folgen hiernach nur noch Automatismen bzw. Endet er die Prozesskette?\n•\tWelche Arbeitsschritte benötigen diesen Arbeitsschritt als Voraussetzung?\n•\tWelche Arbeitsschritte beinhaltet dieser Arbeitsschritt?\n•\tWo wird dieser Arbeitsschritt ausgeführt? (Ort. Kann dies auch Remote erledigt werden oder sind lokale Informationen notwendig?)\n•\tWelche Tools bzw. Handwerkzeug werden für diesen Arbeitsschritt eingesetzt?\n•\tWas ist an diesen Tools so besonders, das nur Sie benutzt werden können oder könnte man Sie auch ersetzten?\n•\tVerfügt das Tool über eine Schnittstelle und kann von anderer Software angesteuert werden?\n•\tWelche rechtlichen Voraussetzungen braucht man, um diesen Arbeitsschritt durchführen zu dürfen?\n•\tWerden bei diesem Arbeitsschritt Personenbezogene Daten erhoben, die DSGVO kritisch sind?\n•\tWer kann diesen Arbeitsschritt durchführen und warum kann es niemand anderes?\n•\tKönnte man diesen Arbeitsschritt auslagern?\n•\tWelche Informationen über den Auftrag sind notwendig, um diesen Arbeitsschritt durchzuführen?\n•\tWas passiert, wenn dieser Arbeitsschritt nicht abgeschlossen wird oder gar nicht erst gemacht wird?\n•\tWie lange dauert dieser Arbeitsschritt normalerweise?\n•\tWas kann bei diesem Arbeitsschritt schiefgehen? Was sind die üblichen Probleme und Fehler, die unterlaufen können?\n•\tWas soll mit diesem Arbeitsschritt erreicht werden?\no\tWas ist das gewünschte Ergebnis\no\tSoll es Kundenzufriedenheit schaffen?\no\tIst es notwendig, um das Produkt zu schaffen?\no\tIst es, um Daten für Verbesserungen in der Zukunft zu schaffen?\n•\tWie gerne machen Sie diesen Arbeitsschritt?\no\tUm zu bewerten, ob der Nutzer den Prozess weitgehend erfasst hat und eine Automatisierung leicht sein könnte\no\tUm zu bewerten, ob der Nutzer für diesen Prozess die Software häufig einsetzten würde oder ob hier wahrscheinlich nur ein Checker sinnvoll ist der den Kunden Prozesssicherheit gibt\n•\tWas sind Dinge die an diesem Arbeitsschritt verbessert werden könnten?\no\tWie sähe dieser Prozess idealerweise aus?\n•\tGibt es jemanden der diesen Schritt schonmal übernommen hat und wenn ja was waren seine Probleme dabei\n•\tGibt es bereits Schulungsunterlagen zu diesem Arbeitsschritt?\n•\tWas ist die Konsequenz, wenn dieser Arbeitsschritt scheitert?\n•\tSeit wann machen Sie diesen Arbeitsschritt?\n•\tWie ist dieser Arbeitsschritt entstanden?\n•\tGibt es eine Software, die Sie dafür benutzen wollen würden, aber nicht kaufen? Wenn wieso?\n•\tBezieht sich dieser Arbeitsschritt direkt oder indirekt auf Aufträge \no\tWenn ja: Wie wird erkannt, dass er sich direkt auf einen Auftrag bezieht\no\tWenn nein: worauf bezieht er sich dann"
    },
    {
        "chapter_title": "DAS ANLERNEN VON NADOO MITARBEITERN 2.0",
        "chapter_content": "Durch die Tools im NADOO System können neue Mitarbeiter deutlich effektiver angelernt werden. Sie können mittels der Schulungsunterlagen auch komplexere Prozesse schneller erfassen und sind weniger auf die Betreuung durch einen erfahrenen Kollegen angewiesen. Auch bieten die Tools Hilfestellungen und geben dem neuen Angestellten die Möglichkeit seine Arbeit kontrollieren zu lassen. Dadurch das viele der Prozesse so gut unterstützt sind wird es auch deutlich leichter Teilaufgaben anstelle von kompletten Projekten an einen neuen Angestellten abzugeben. Dadurch werden diese nicht sofort überfordert und fühlen sich dennoch wohl dabei Fehler zu machen. Dies wird möglich da Sie wissen, dass Sie am Ende durch die Programme eine Kontrolle durchführen lassen können und so nicht direkt perfekt arbeiten brauchen. Aus der Lernforschung wissen wir auch, dass Fehler machen der beste Weg ist, um zu lernen und Kompetenzen aufzubauen. Dementsprechend ist davon auszugehen, dass eine solche Unterstützung die Zeit, bis ein neuer Angestellter viele der Prozesse beherrscht deutlich verkürzt.\nWas besonders ist, dass durch das NADOO System es möglich wird für Personen, die möglicherweise in einem Unternehmen arbeiten wollen, anhand von fiktiven Projekten, bereits Arbeitsschritte auszuprobieren. So erlernen Sie die notwenigen Arbeitsschritte und können eine Informierte Entscheidung treffen, ob Sie diesen Beruf ausüben wollen. \nSo ändert sich der Bewerbungsprozess von einem Markt in dem der Arbeitgeber noch unklar darüber ist ob seine neue Angestellten tatsächlich in der Lage sind die von Ihm verlangten Aufgaben auszuführen und darauf hoffen muss, das er nicht an einen Betrüger gerät oder überhaupt Bewerber erhält, zu einem Arbeitsmarkt auf dem sich Personen auf seine Aufgaben bewerben, die bereits Erfahrung darin haben die bei Ihm anstehende Arbeit zu erledigen und die auch schon bewiesen haben, dass Sie zu dieser Arbeit in der Lage sind."
    },
    {
        "chapter_title": "NADOO IT: DATEN UND CYBERSICHERHEIT",
        "chapter_content": "Durch die Einführung des NADOO Keys entsteht eine neue Dynamik im Bereich der Cybersicherheit. Zum ersten Mal ist es unmöglich, Benutzerkonten durch \"Hacking\" zu kompromittieren, da es keine Passwörter gibt und der Zugang zum NADOO-System nur über den Schlüssel möglich ist. Nutzer können nicht versehentlich ihre Zugangsdaten preisgeben oder durch Phishing oder andere Angriffe dazu verleitet werden. Sobald die Nutzer die zweite Generation des NADOO Keys erhalten, können sie ihre Schlüssel auch durch biometrische Daten zusätzlich sichern. Dadurch ist es selbst bei einem physischen Diebstahl des Schlüssels und Kenntnis des Benutzernamens nicht mehr möglich, auf das Benutzerkonto zuzugreifen.\nZusätzlich sind alle Daten auf den Servern verschlüsselt gespeichert, sodass sie selbst im Falle eines Diebstahls nutzlos wären. Es besteht auch keine Verpflichtung, direkt auf die Person zurückzuführende Informationen in das System einzugeben. Daher kann ein Angreifer selbst dann nichts damit anfangen, wenn es in Zukunft möglich sein sollte, die Daten zu entschlüsseln."
    },
    {
        "chapter_title": "WIE LÖST NADOO IT DIE FRAGE VON QUALIFIKATION?",
        "chapter_content": "NADOO IT bietet eine neue Alternative zu den existierenden Vertragsmodellen. Eines der daraus resultierenden Vorteile ist, dass die Frage nach Qualifikation überflüssig oder zumindest weitgehend irrelevant wird. Dies ist in den bestehenden Vertragsmodellen anders. In den folgenden zwei Kapiteln gehe ich direkt auf die bestehenden Vertragsmodelle ein und zeige den klaren Unterschied zwischen Ihnen und der durch NADOO IT entstehenden Vertragsstruktur."
    },
    {
        "chapter_title": "NADOO IT IM VERGLEICH MIT WERKSVERTRAG",
        "chapter_content": "Beim Werksvertrag wird ein Projekt vereinbart und sowohl auf der Seite des Entwicklers als auch auf der Seite des Kunden finden Kalkulationen über den ROI statt. Der Entwickler will so wenig wie möglich machen und dafür so viel wie möglich abrechnen, während der Kunde so viel wie möglich erhalten will aber so wenig wie möglich dafür bezahlen möchte.\nEins der Kernprobleme, das durch NADOO IT gelöst wird, ist das es hier einen klaren Konflikt der Interessen gibt. Zusätzlich werden viele Annahmen getroffen, um auf beide Seiten den ROI zu bestimmen.  Diese ROI-Kalkulation erzeugt viel verschwendete Zeit und Kosten. Durch NADOO IT ist eine solche Kalkulation irrelevant. Der Kunde macht, da er erst anfängt zu bezahlen, wenn er bereits den gewünschten Effekt erhält, von Anfang an des Bezahlvorganges bereits Gewinne. \nSo wird ein Zögern sinnlos. \nAuf der Seite des Entwicklers fällt ebenfalls die ROI-Kalkulation weg. Es verbleibt nur die Frage, ob man eine bestimmte Aufgabe lösen kann bzw. möchte. Die entwickelte Software wird voraussichtlich eine lange Zeit genutzt und erzielt so einen ROI. Zusätzlich steigen die Einnahmen seiner Software umso erfolgreicher sein Kunde ist. Der Entwickler kann die Software an andere Kunden verkaufen und so die Geschwindigkeit bis sein ROI erreicht ist erhöhen. \nDiese Wiederverkaufspraxis ist eher selten bei Unternehmen außerhalb des NADOO Netzwerks, die Spezialsoftware für sich entwickeln lassen. Da im NADOO IT System ein Anteil der Einnahmen aus dieser für sie speziell erstellten Software auch an Sie fließt, können Sie sich sicher sein, dass Sie auch davon profitieren, sollte ein „Konkurrent“ „Ihre“ Software verwenden."
    },
    {
        "chapter_title": "NADOO IT IM VERGLEICH MIT DIENSTLEISTUNGSVERTRAG",
        "chapter_content": "Bei einem Dienstleistungsvertag besteht genauso wie beim Werksvertrag ein Kerninteressenkonflikt. \nDer Entwickler will so viel Geld pro Stunde verdienen wie möglich, denn er weiß nicht, wann sein nächster Vertrag kommen wird. Er weiß nicht, wie lange er für die gegebene Aufgabe brauchen wird. Eine Fehleinschätzung ist generell schlecht. \nSchätzt er eine kürzere Entwicklungszeit als tatsächlich notwendig, kann dies bedeuten, dass es zu einer Verärgerung auf Seiten des Kunden kommt. Dies kann Rufschädigung und das Ausbleiben von Folge Projekten bedeuten, was für einen freien Entwickler sehr schlecht sein kann.\nSchätzt er länger und stellt die Software vorzeitig fertig ist er dazu an geneigt dem Kunden vorzugaukeln, dass er noch nicht fertig ist, da er sonst möglicherweise deutlich mehr erbringen darf als zuvor vereinbart, was zu Enttäuschung und hohem Druck führen kann. \nHierdurch kommt es zu dem sogenannten „Underpromise and overdeliver“ Effekt.\nFür den Kunden besteht genau das gegenteilige Interesse. \nEr will so wenig Geld wie möglich zahlen, so schnell wie möglich und so viel wie möglich an Produkt erhalten. Wie man hier sehen kann, sind die Interessen der Beiden Parteien komplett gegensätzlich, was ein Spannungsbasiertes Arbeitsverhältnis erzeugt, bei dem immer einer der Parteien den anderen ausnutzt.\nSowohl die Probleme des Werksvertrags als auch des Dienstleistungsvertrag stammen aus einem Kernproblem. Dieses Kernproblem ist der Grund für den Titel dieses Kapitels.\n„Die Frage der Qualifikation“\n\nIn beiden Fällen spielt die Qualifikation eine grundlegende Rolle. \nIst der Entwickler überqualifiziert für die Aufgabe, ist er zwar in der Lage die Aufgabe schnell zu erledigen, jedoch wird häufig ein schnell geliefertes Produkt so bewertet, dass es günstig hätte sein müssen. \nSomit ist es fast schädlich für einen Entwickler schnell seine Arbeit zu erledigen, da dies vom Kunden wie beschrieben negativ ausgelegt werden könnte.\nDiese Probleme entstehen dadurch, dass das Produkt bepreist, wird anstelle des Effekts durch das Produkt. Dies wird durch NADOO IT komplett verändert. \nDurch NADOO IT wird ein Verschieben der Bepreisung des Produktes zu einer Bepreisung des Effektes erreicht.\nEs spielt keine Rolle, ob ein Entwickler mit 10 Jahren Erfahrung ein Programm in 2 Stunden oder ein Entwickler mit 1 Monat Erfahrung in 2 Wochen entwickelt. Der einzige Unterschied ist wie schnell die Bezahlung eintritt.\nDurch die Sicherheitsmechanismen und die Qualitätskontrolle durch das NADOO System wird immer garantiert, dass der Code hochwertig ist und keine offensichtlichen Sicherheitslücken zulässt.\nDa der Kunde keinen Auftrag zur Entwicklung gibt, gibt es auch keine Erwartung bezüglich des Fertigstellungstermins. Stattdessen bekommt der Kunde am Ende des Entwicklungsprozesses die Benachrichtigung, dass wieder ein neues Tool für Ihn bereitsteht und getestet, eingeführt und gemessen werden kann.\nDer Kunde brauch sich so um nichts kümmern als einmal den Prozess erfassen zu lassen und dann die neue Software abzunehmen. Keine Preisverhandlung, keine Ermittlung von Qualifikationen, Vertragsverhandlungen usw.\nEin vollständiger Shift von Produkt oder Arbeitsorientiertem Handel zu einem Ergebnisorientierten Handel.\nManche Entwickler geben eine „Zufriedenheitsgarantie“ jedoch ist zufrieden und Erreichen des gewünschten Effektes zwei sehr unterschiedliche Dinge. Durch NADOO IT wird auch dieses Problem beseitigt."
    },
    {
        "chapter_title": "FRAGEN DIE HIER ENTSTEHEN KÖNNTEN",
        "chapter_content": ""
    },
    {
        "chapter_title": "WIE KANN DER ENTWICKLER DIE SOFTWARE AN ANDERE KUNDEN VERKAUFEN UND SEINE EINNAHMEN ERHÖHEN, OHNE DASS ES ZU KONFLIKTEN MIT DEM URSPRÜNGLICHEN KUNDEN KOMMT?",
        "chapter_content": "Hierbei sind zwei Punkte entscheidend zu verstehen. Jede Software existiert in 2 Stufen. \nStufe 1 ist die NADOO IT Ebene. Diese ist die reine Logik der Software. Also die Funktionalität. Diese ist losgelöst von der tatsächlichen Grafischen Anwendung.\nDie zweite Stufe ist genau diese die Grafische auf den Endanwender hin angepasste Version. Diese hat Ihren eigenen Produktcode und wird separat von Stufe 1 gehandhabt. Sie hat Ihr eigenes Entwicklungsbudget und ihre eigenen Einnahmen. Sie profitiert aber von der Verbesserung der ersten Ebene. So sollten Probleme in der Funktionalität auffallen, können diese dort korrigiert werden und werden so auch bei allen Kundenimplementationen, auf Ebene zwei, korrigiert.\nDieser Ansatz ist insofern eine Umkehrung von Produkten wie SAP. Bei SAP wird zunächst ein Standardprodukt hergestellt und für dieses die Kunden gesucht und dann kann dieser Kunde wiederrum das Standard Produkt auf seine individuellen Anforderungen kostenpflichtig hin anpassen lassen.\nIm NADOO System entsteht zunächst das Kundenindividuelle Produkt, dann wird die Funktionalität aus diesem herausgelöst. Wird bei einem anderen Kunden dann ein sehr ähnlicher Prozess erkannt so wird für diesen ein entsprechendes Interface angefertigt bzw. an sein bestehendes angeschlossen."
    },
    {
        "chapter_title": "WIE FÜHRT NADOO IT ZU OPTIMALER UND SICHERER SOFTWARE?",
        "chapter_content": "Dadurch das bei NADOO IT nur Umsätze generiert werden, wenn die Software eingesetzt wird, sind Dinge wie „Ausfälle“, „Fehler“, „Sicherheitslücken“, „schlecht optimierter Code“, „schlecht Strukturierter Code“, „schlecht gewählte Technologie“ und viele der in anderen Softwareprodukten häufig vorkommenden Probleme wesentlich schlimmer. In den meisten Fällen ändert das Auftreten solcher Probleme kaum bis nicht die Einnahmen durch die Software. Ob ein Programm 5 Minuten oder 2 Minuten in Anspruch nimmt, um eine Berechnung durchzuführen, hat Auswirkungen für den Kunden aber nicht Einnahmeauswirkungen für den Vertreiber. \nBei NADOO IT dagegen wird diese Differenz berechnet. \nTreten Fehler bei einer Anwendung auf, so hat dies im klassischen Modell kaum bis keine Auswirkungen, solange keine Strafe vereinbart wurde. Bei Produkten, die mittels NADOO IT entwickelt wurden, hingegen wird kein Geld mehr mit einem Programm erwirtschaftet sollte es nicht einsatzbereit sein und der Kunde kann das Programm reklamieren, wodurch es kostenfrei für Ihn wird. Es findet also ein Wechsel, von einer „problemreichen Software“ die Rufschädigend und so indirekt Einnahmenschädigend ist zu einer „problemreichen Software“ die direkt finanziell schädlich ist, statt. Auch hier unterscheidet sich NADOO IT fundamental in der Verantwortungsrolle, was Software betrifft. \nGleiches gilt auch für ein Problem, das viele Unternehmen plagt, die sich für eine bestimmte Software entschieden haben. \nGroße Hersteller wie Google, Microsoft und Andere stellen regelmäßig Produkte ein, die tausende, wenn nicht Millionen von Nutzern haben. Die Kunden, die sich für diese Systeme entschieden haben, sind dann oft gezwungen auf andere Produkte umzusteigen und tragen die hohe Last, die dadurch entsteht. In vielen Fällen haben Sie hier nicht mal eine Wahl, da die Produkte komplett vom Markt genommen werden. Dies ist nicht möglich bei NADOO IT. Alle Software ist Open Source. Alle Software kann von Kunden selbst angepasst und weiterverwendet werden. NADOO IT gibt hierbei keine Garantie auf diese Anpassungen. Jedoch ist es dem Kunden sollte NADOO IT Software nicht weiter von Christoph Backhaus IT vertrieben werden diese selbständig zu hosten, verwalten und zu erweitern. Da alle Software mit gängigen Programmiersprachen entwickelt wird ist das Finden von freien Entwicklern bzw. Entwicklern, die man anstellen kann, ein leichtes. Das Einzige, wozu sich die Kunden verpflichten, ist die durch sie erstellten Updates, von bestehenden Features und Sicherheitsupdates, auch allen anderen Kunden zur Verfügung zu stellen.\nDurch diese Art der Softwarelizensierung ist sichergestellt, dass Kunden egal welcher Größe immer mit der aktuellen und sichersten Software arbeiten und so das Netzwerk gegen Angriffe und Störungen gesichert ist. Es schafft eine vom Softwareersteller unabhängige Struktur, die aber gleichzeitig nicht dazu führt, dass keine neue Software entwickelt wird, da diese nicht finanziell rentabel wäre. Es stellt sicher, dass der Kunde unabhängig ist vom System selbst und im „Notfall“ die Entwicklung auch selbstständig weiterbetreiben kann.\nAuch sind die Daten der Kunden in einem Format vorhanden, das den Transfer zu anderen Systemen leicht macht und so dem Kunden die Möglichkeit gibt, wenn er dies wünscht in ein anderes zu wechseln. Es ist an den Entwicklern im NADOO Netzwerk dem Kunden ein Angebot zu machen, dass dieser nie davon Gebrauch macht, außer es handelt sich um einen Kunden der schlicht nicht mehr in die derzeit vorhandenen Produkte des Netzwerkes passt."
    },
    {
        "chapter_title": "WIE UNTERSCHEIDET SICH NADOO IT VON DEN BESTEHENDEN STRUKTUREN?",
        "chapter_content": "In diesem Kapitel wird NADOO IT mit den möglichen Alternativen verglichen und die Vorteile und Nachteile gegenübergestellt. \nHierbei ist zu beachten, dass diese Alternativen nicht zwingend in Konkurrenz zu NADOO IT stehen. Sie ergänzen sich bzw. haben andere Bereiche, für die sie sich besser eignen. \nNADOO IT zielt nicht darauf ab einen vollständigen Ersatz für die bestehenden Methoden zu bilden, sondern einen weiteren Baustein für den Digitalisierungsprozess anzubieten!"
    },
    {
        "chapter_title": "INTERNE IT-ABTEILUNG",
        "chapter_content": "Eine eigene interne IT-Abteilung ist für viele Unternehmen eine große Investition. \nDerzeit ist der Preis für einen Softwareentwickler noch sehr hoch. Aufgrund der hohen Kosten haben die meisten Unternehmen eher kleinere Softwareteams. Durch die kleine Größe dieser Teams entsteht eine gefährliche Situation mit einer Vielzahl von Problemen. \nIn kleinen Entwicklerteams ist das Wissen über die Funktionalität der Software sehr konzentriert in einzelnen Personen. Dadurch erfordert das Anlernen eines neuen Entwicklers sehr viel Zeit. \nFällt ein Entwickler durch Krankheit aus, stagniert die Entwicklung. Kehrt ein Entwickler nicht wieder zurück, weil er arbeitsunfähig geworden ist oder eine neue Stelle gefunden hat, ist das Wissen verloren. \nEinen neuen Entwickler zu finden, der das alte Programm übernehmen möchte ist schwer. Besonders wenn die Software in einer mittlerweile unbeliebten Sprache programmiert wurde. Für solche Sprachen gibt es kaum bis keine Entwickler mehr bzw. sind diejenigen die es noch gibt viel zu teuer, was bedeutet das die Software damit praktisch „Tod“ ist.\nIst eine Software in einer „sterbenden“ Sprache geschrieben, ist es auf lange Sicht notwendig sie komplett neu zu schreiben. Geschieht dies nicht treten mit der Zeit Sicherheitslücken oder zuvor unbekannte Fehler auf, wodurch das System instabil und schlussendlich unbrauchbar wird. \nDurch die geringe Anzahl von Teammitgliedern werden keine guten Programmierpraktiken eingeführt, die Kollaboration, Wartung und Verständnis fördern.\nIn kleinen Teams ist das Wissensspektrum stark durch das Wissen der Mitglieder beschränkt. Umso breiter bzw. größer ein Team ist, umso wahrscheinlicher ist es, dass ein Mitglied des Teams bereits Erfahrung darin hat, wie man ein bestimmtes Problem lösen kann. In einem kleinen Team dagegen werden Probleme dagegen nicht mal erkannt.\nBesonders in kleinen Entwicklerteams kommt es schnell dazu, dass ab einem sehr schwer zu ermittelndem Zeitpunkt, Entwicklerinnen und Entwicklern zu vertraut mit den Prozessen sind. Hierdurch verlieren Sie den Blick für die wichtigen und gut zu automatisierenden Prozesse. Um diesem Effekt entgegenzuwirken ist es notwendig regelmäßig neue Entwickler und damit „frische“ Augen in den Entwicklungs- und Analyseprozess mitzuinvolvieren, was in dieser Form von IT-Abteilung eher selten ist.\n\nDurch das sehr kleine Team entsteht eine beidseitige Abhängigkeit, die für keine der Parteien von Vorteil ist. Zwar mag für die Programmierer eine hohe Jobsicherheit bestehen, jedoch ist der hohe Abhängigkeitsgrad auch mit sehr viel Verantwortung und Druck verbunden. Hierdurch wird es sehr schwer für einen der Entwickler von seiner Arbeit Abstand zu nehmen. Ohne Ihn stoppt nicht nur die Entwicklung, sondern ist in Krisensituationen auch niemand in der Lage das Problem zu lösen. Hierdurch fällt es Entwicklern auch im Urlaub schwer sich zu erholen, wodurch eine hohe Belastung entsteht. Einige Softwareentwickler verlassen deswegen schlussendlich das Unternehmen oder sogar die Branche. \nGleichzeitig entstehen Sorgen auch auf Seiten der Geschäftsführung. \nSie sind sich bewusst, dass eine hohe Abhängigkeit von der bestehenden Software existiert. Sie haben erkannt das viele Ihrer bestehenden Geschäftsprozesse ohne die Software kaum noch durchführbar sind. Aufgrund der starken Abhängigkeit kann es aber gleichzeitig zu einem Misstrauen kommen. \nIn den meisten Fällen haben die Geschäftsführung bzw. Verantwortungsträger nur wenig bis keine Erfahrung auf dem Bereich der Softwareentwicklung. Dies macht es Ihnen sehr schwer die Arbeit der Entwickler einzuschätzen. Häufig kommt es hierdurch auch zu falschen Vorstellungen über die Möglichkeiten bzw. den zu erwartenden Zeithorizont bei der Entwicklung von neuer Software. Dadurch entstehen Konflikte, die zu Spannung und Enttäuschung führen. Wiederholt sich Spannung und Enttäuschung entsteht Verdrossenheit auf Seiten der Entwickler und eine Misstrauenshaltung auf Seiten der Verantwortungsträger. \nSollte es zum Zusammenbruch eines internen Entwickler Teams kommen, werden nicht selten folgende Lektionen gelernt:\n-\tSpeziell für eigene Betriebsprozesse entwickelte Software ist gefährlich\n-\tStandardtools sind dem vorzuziehen\nZusammengefasst:\nNegativ:\n-\tTeuer\n-\tHoher Grad an Abhängigkeit\n-\tNeues Wissen kommt nur selten in das Unternehmen\n-\tWissen ist sehr konzentriert in einer kleinen Anzahl von Angestellten\n-\tSchwer einzuschätzen ob und welche Qualifikation für neue Entwickler wichtig sind\n-\tEntscheidung über die Auswahl von Technologie ist durch Kenntnisstand eingeschränkt\n-\tCode ist durch mangelnde Kollaboration meist schwer für neue Entwickler zu verstehen\n\nNADOO IT bietet Unternehmen, die bereits Ihre eigene IT-Abteilung haben, eine Lösung für all diese Probleme. \nIm NADOO IT Netzwerk gibt es keine direkte Personalbindung und somit auch keine Personalkosten. Der Kunde entscheidet selbst wie viel zusätzliche Arbeitszeit er im laufenden Monat benötigt bzw. wie viele Aufträge er durch NADOO IT Maßnahmen generieren möchte. Durch diese Entscheidung wird indirekt auch das Investitionsvolumen für weitere IT-Entwicklung bestimmt. Somit wird vermieden übermäßig in die IT zu investieren, wenn dies an dem gegebenen Punkt keinen Effekt hätte.\nAnstelle selbst zunächst nach neuen Projekten zu suchen und dann Entwickler damit zu beauftragen Software für diese zu entwickeln, sind die Arbeitsprozesse, die bereits bestehen, auf der NADOO IT Plattform für freie Entwickler/Teams einsehbar. Die Entwickler bewerben sich und entwickeln selbstständig Software für die Prozesse, für die Sie sich geeignet sehen. Hierdurch fallen viele der zuvor notwendigen Fragen nach der Auswahl von Technologie, Qualifikation und viele weitere weg. Dadurch das die Software von einer Vielzahl von Entwicklern entwickelt wird, ist sichergestellt, dass weniger Arbeitsblindheit entsteht. \nDurch die Qualitätskontrolle durch NADOO IT ist sichergestellt, dass die Software sowohl sicher als auch von hoher Qualität ist. Dies wird sichergestellt, indem der Quellcode für alle Entwickler auf der NADOO IT Plattform einsehbar ist. Dies führt dazu, dass auch Entwickler, die nicht direkt an der Entwicklung beteiligt waren diesen prüfen und auf mögliche Sicherheitslücken hinweisen. Um dies zu fördern bzw. Entwickler dazu zu motivieren, hat jede Software ein Budget für nicht Entwickler, eine solche Prüfung durchzuführen. Ein dieser Methodik nahekommendes Verfahren sind sogenannte Bug Bounties. Bei diesen, werden ebenfalls öffentlich Preisgelder ausgeschrieben, für das Aufdecken von Sicherheitslücken. Das Budget System von NADOO IT unterscheidet sich hier nur dadurch, dass auch für neue Features und Anpassungen solche öffentlichen Budgets existieren.\nDas besondere für Unternehmen, die bereits über eine interne IT-Abteilung bzw. interne Softwareentwickler verfügen ist, dass diese nicht in Konkurrenz mit NADOO IT Entwicklern stehen. Stattdessen gibt NADOO IT Ihnen die Möglichkeit Ihre Software auf der Plattform zugänglich zu machen und so auf viele andere Entwickler zuzugreifen. Interne Entwickler können sich an Projekten von anderen Kunden des NADOO IT Netzwerkes beteiligen und so zusätzliche Einnahmen für Ihren Arbeitgeber generieren. Durch das Arbeiten können Sie Ihr bestehendes Wissen anwenden und durch Austausch mit anderen Entwicklern erweitern.\nDadurch, dass die interne Software durch deutlich mehr Entwickler entwickelt wird, fällt der Druck auf den einzelnen Entwickler weitgehend weg. Die Abhängigkeit zwischen Arbeitgeber und Entwickler wird reduziert. Sollte ein Entwickler den Betrieb verlassen, kann er dennoch weiter an der internen Software über die NADOO IT Plattform als einer der freien Entwickler weiterarbeiten. Hierdurch kann der Wissensverlust weitgehend verhindert werden.\nHierdurch ist es möglich, dass alle Vorteile einer eigenen IT-Abteilung beibehalten werden, während die Nachteile ausgeglichen werden. Zusätzlich ergeben sich einige weitere Vorteile, die mit einer eigenen IT-Abteilung schwer oder gar nicht abbilden lassen.\nVorteile von NADOO IT:\n•\tKeine Personalbindung, da alle Softwareentwickler für die im NADOO System verwaltete Software Arbeiten und nicht für das Unternehmen selbst.\n•\tKein Risiko von Scheinselbstständigkeit dank Gutschriftverfahren.\n•\tWerben von neuen Softwareentwicklern entfällt, da sich diese selbst auf Projekte bewerben bzw. diese direkt annehmen und bearbeiten.\n•\tFragen nach Qualifikationen, ob ein Entwickler ein Problem lösen kann, sind irrelevant, da sich ein Entwickler entweder nur auf ein Projekt bewirbt, für welches er bereits die notwendigen Qualifikationen hat oder diese im Verlauf der Projektarbeit erwirbt. \n•\tIst ein Betrieb „vollständig“ optimiert würde normalerweise der Nutzen des Entwicklerteams entfallen. Dies führt dazu das sich das Team Aufgaben sucht, die nicht zwingend notwendig sind und erzeugt zusätzliche Kosten ohne einen garantierten Mehrwert. Im NADOO IT System wird dies vermieden da für solche Leistung nichts gezahlt wird. Die Entwickler suchen sich selbstständig neue Projekte. Für den Kunden wird so automatisch, dass Paretoprinzip umgesetzt.\n•\tDurch eine Qualitätskontrolle am Ende der Entwicklung ist sichergestellt, dass nur funktionale und sichere Software im Unternehmen eingesetzt wird.\n•\tKeine Notwendigkeit der Leistungskontrolle, da nur für den Effekt gezahlt wird. Arbeitet ein Entwickler an einem Projekt erfolglos entstehen dem Kunden keine Kosten.\n•\tEs muss bei mangelhafter Arbeit kein Personal entlassen werden, da selbst ein langsamer und möglicherweise „unsauberer“ Entwickler nur für erfolgreiche Leistung bezahlt wird.\n•\tDurch die reine Bepreisung des Erfolges ist Verschwendung weitgehend vorgebeugt, was bei internen fest angestellten Entwicklern schlecht, bis gar nicht umsetzbar ist.\n•\tDurch das System wird immer genau so viel Investment in die IT getätigt, wie zum aktuellen Zeitpunkt sinnvoll ist. Budget Fragen erübrigen sich, da der Bedarf durch die direkte Anwendung direkt gesteuert wird. Gleichzeitig sollte mehr Investment gewünscht sein kann dies ebenfalls umgesetzt werden, indem der Kunde Zeitersparnis, die in der Zukunft liegt, vorzeitig erwirbt und so zusätzliches Investment für Neuentwicklung freigibt.\n•\tDadurch, dass die Software auch an andere Unternehmen innerhalb des NADOO Netzwerkes verkauft wird, profitieren Sie als Kunde von Skalierungseffekten, die sonst nur in Megakonzernen möglich wären. Updates und Feature Entwicklungen, die für andere Kunden getätigt wurden, fließen direkt bei Ihnen mit ein. Somit profitieren Sie nicht nur von dem IT Investment Ihrerseits, sondern auch der anderen Kunden des NADOO Netzwerks.\n•\tDie für den Kunden entwickelte Software wird an andere Kunden vertrieben und erzeugt einen neuen Einnahmezweig für den Kunden, der Ihn weniger abhängig von seinem Tagesgeschäft macht.\n•\tBei einer eigenen IT-Abteilung ist der Zugriff auf Personal begrenzt. Im NADOO Netzwerk stehen dem Kunden potenziell zehntausende Entwickler zur Verfügung.\n•\tDurch das einzigartige sich selbst erstellende Budgets der Programme entsteht ein sehr ähnlicher Findungsprozess ähnlich dem im hier gezeigten Video, der für einen optimalen Prozess und minimales Fehlinvestment führt: https://youtu.be/GwKuFREOgmo. Gleichzeitig wird der Verwaltungsaufwand minimiert.\n•\tSoftwareentwickler Teams im NADOO System suchen sich selbst Ihre Gruppenleitung aus. Teams, die keine effektive Arbeit leisten lösen sich wieder auf, während effektive und sich gut miteinander ergänzende Teams wachsen.\n•\tEs entstehen keine Managerrollen, die nicht absolut notwendig oder zumindest hilfreich sind. Teams, die ein zu großen Manageranteil haben, die nicht zu einem positiven Ergebnis beitragen zerstören sich schnell selbst. Die Probleme des Peter Prinzips und das Parkinson’sche Gesetz werden so verhindert.\n•\tLangwierige Verhandlungen zwischen freien Entwicklern und Unternehmen sind überflüssig. Dadurch, dass nicht für ein Produkt, sondern für dessen Effekt gezahlt wird und der Preis bereits durch NADOO vorgegeben ist können sich die beiden Parteien (Kunde und Entwickler) unabhängig voneinander für ein gegebenes Projekt entscheiden. Der Kunde kann freigeben, dass er einen Prozess automatisiert haben möchte, während der Entwickler entscheidet ob er für den gegebenen Preis das Projekt annimmt. Da der Preis direkt an den Effekt gebunden ist, braucht der Kunde lediglich sich die Frage zu stellen, ob er den Stundenpreis am Einsatzort der Software zahlen möchte bzw. ob er dies zu dem Zeitpunkt des Bedarfes für gerechtfertigt hält.\n•\tAls Kunde kann bei einem Auftragsrückgang weniger Automatisierung genutzt werden, wenn es zu dem gegenwertigen Zeitpunkt wirtschaftlich für diesen keinen Sinn macht. Dadurch kann flexibel und situationsentsprechend, die Kapazität des Unternehmens angepasst werden.\n•\tDas Fachwissensungleichgewicht, das sonst beim Verhandeln besteht, wird irrelevant da der Kunde nicht den Weg der Lösung zahlt, sondern für die Lösung, welche von beiden Parteien klar verständlich ist, selbst. Auch in der Zukunft, wäre von einem Entwickler zuvor eine möglicherweise ineffiziente Lösung gewählt worden, ist dies irrelevant, da vom Kunden auch wieder nicht für die Lösung des daraus resultierenden Problems gezahlt wird, sondern wieder nur für die Gesamtverbesserung seiner Prozesse."
    },
    {
        "chapter_title": "IT-DIENSTLEISTER",
        "chapter_content": "Aufgrund der vielen Problematiken mit einer eigenen IT-Abteilung, greifen einige Unternehmen auf IT-Dienstleister zurück. Dies ist definitiv besser als keine IT einzusetzen. Beim Einsatz von IT-Dienstleistern kommt es jedoch auch zu einigen Problemen, auf die in diesem Kapitel eingegangen wird.\nDas größte Problem besteht darin, welche Projekte durch IT-Dienstleister abgedeckt werden. \nSo werden die wenigsten IT-Dienstleister die effektivsten Elemente des Arbeitsprozesses automatisieren, da diese meist viel zu klein sind und sich nicht für langfristige Projekte eignen. IT-Dienstleister sind in den meisten Fällen auf größere Projekte, die eine längere Entwicklungsdauer umfassen angewiesen. \nHierdurch entsteht sogenannter „Feature Creep“. Unternehmen bzw. diejenigen, die ein Software-Projekt leiten, wollen, dass die bestellte Software immer mehr und mehr Funktionen umfasst. Da es, wie zuvor erwähnt, es im Interesse des IT-Dienstleisters ist ein möglichst großes Projekt zu erhalten, gibt es für diesen wenig, bis keine Gründe Kundenwünsche abzulehnen, auch wenn dies besser für den Kunden wäre. \nHier wird wieder deutlich und es wird auch in den folgenden Vergleichen noch häufiger aufkommen, dass so lange kein Bezahlungssystem verwendet wird, bei dem die Interessen von Kunde und Entwickler übereinstimmen, es immer zu einem Interessenskonflikt kommt. Auch möchte ich hier wieder klarstellen das Ich keiner der Parteien eine „böse“ Absicht unterstelle. Alles Verhalten und die möglicherweise negativen Folgen daraus sind ein Resultat des Bezahlungsmodells und nicht der individuellen Einstellung.\nWichtig hierbei ist auch zu erkennen, dass selbst eine subjektive Zufriedenheit auf Seiten des Kunden nicht in dessen Interesse sein muss. So kann es sein das objektiv betrachtet das Projekt ein Misserfolg war, da es nicht zu einer Wertgewinnungssteigerung geführt hat, aber da es die Wünsche des Kunden erfüllt hat zu dessen Befriedigung beigetragen hat. Problematisch daran ist, dass so Software zu einer Selbstzweckerfüllung und nicht zwingend zu einem Werkzeug der Wertgewinnung wird.\nDurch den IT-Dienstleister werden einige der Problematiken, die bei einer eigenen IT-Abteilung bestehen nicht aufgehoben. So ist ein IT-Dienstleister ebenfalls in seinem Kenntnisspektrum eingeschränkt. Die Geschwindigkeit der Digitalisierung ist ebenfalls durch die Größe des Entwickler Teams begrenzt und kann sich nicht schnell anpassen. Auch ist die Geschwindigkeit, mit der die Automatisierung umgesetzt wird, begrenzt durch wie viel der Kunde in Vorleistung geht. \nNADOO IT schafft es all diese Punkte zu beseitigen.\nDie meisten dieser Probleme werden dadurch, dass nur eine messbare Verbesserung des Arbeitsprozesses zu Einnahmen führen, vermieden. So wird „Feature Creep“ nachteilig für die Entwickler, da Sie für dies nicht bezahlt werden. Entwickler werden über die Zeit darauf trainiert die Wünsche von Kunden abzulehnen, die eine rein subjektive Verbesserung bedeutet hätten. Stattdessen werden Sie darauf fokussiert eine objektive Verbesserung herzustellen. Entwickler, die noch am Anfang Ihrer Karriere stehen, werden höchstwahrscheinlich zunächst an dieser Herausforderung scheitern. Um dies zu mindern, gibt es im NADOO IT Netzwerk eine Vielzahl von Schulungen und Mentoren, die neue Entwickler bei diesem Lernprozess unterstützen.\nWie im vorherigen Kapitel bereits erwähnt wurde, steht im NADOO IT Netzwerk potenziell eine unbegrenzte Anzahl von Entwicklern zur Verfügung. So ist es denkbar, dass in ein paar Jahren, wenn ein neuer Kunde dem Netzwerk beitritt, mehrere tausend Entwickler zugleich damit beginnen Software für sein Unternehmen zu entwickeln, und bereits nach wenigen Wochen dessen Unternehmen vollständig digitalisiert ist."
    },
    {
        "chapter_title": "IT-BERATER",
        "chapter_content": "Die klassische IT-Beratung hat sich in den letzten Jahren deutlich verändert. \nSo bestand ursprünglich Beratung tatsächlich rein aus Beratung. \nMittlerweile haben Berater Ihr Angebot um Implementierung und Entwicklung erweitert. Dadurch sind Sie dem NADOO IT System am ähnlichsten. \nNADOO IT versteht sich als die nächste Weiterentwicklung dieser Form von IT-Beratung.\nDie Hauptprobleme die NADOO IT im Zusammenhang mit klassischen IT-Beratern versucht zu lösen sind: \n-\tDie bereits in vorherigen Kapiteln beschriebenen Problemen mit Dienstleistungsverträgen und Werksverträgen \n-\tNotwendigkeit konstant neue Projekte zu erhalten\n-\tUp Sales also Produkte die Kunden verkauft werden, die eventuell nicht dazu beitragen, dass der Kunde einen positiven Effekt erhält\n-\tZugang zu einer deutlich größeren Anzahl von Entwicklern und Experten\n-\tEine schnellere Analyse und Umsetzung Verbesserung und somit deutlich kürzere Bearbeitungszeit von Problemerkenntnis zu Umsetzung\n-\tReduzierung der Bindung zwischen einzelnem Berater und Kunde\n-\tReduzierung der Bindung zwischen einzelnen Berater und dessen Softwareprodukten\n-\tEs wird nicht eine bestimmte Software verkauft, sondern der Effekt der Software\n \nWie bereits erwähnt, hat sich das Angebot des klassischen IT-Beraters bereits um die Implementierung erweitert. Dies ist eine deutliche Verbesserung, denn bis zuvor hatten IT-Berater praktisch keine Qualitätskontrolle für Ihre Beratung. Sie entwickelten Konzepte und die Umsetzung war vollständig durch den Kunden zu bewältigen.\nAus meiner eigenen Erfahrung sind viele der Konzepte, die von Beratern erarbeitet wurden, nur der erste Schritt zu einer tatsächlichen Verbesserung. Erst während der Umsetzung werden viele Details in der Prozesskette klar. Es sind jedoch genau diese Details, die dazu führen, dass Nutzer wieder auf die alte Lösung zurückgreifen. So werden alte Lösungen nie vollständig beseitigt und es entstehen neue Ineffizienzen und Komplexität. Besonders für neue Angestellte wird so der Prozess noch schwerer zu begreifen, da für „Sonderfälle“ wieder auf ein anderes Tool zurückgegriffen werden muss. Das führt zu einem Netz aus vielen Tools, über die selbst Angestellte die lange im Unternehmen sind, den Überblick verlieren.\nDie meisten Firmen haben nicht die Kapazität die Konzepte der Berater selbst umzusetzen. Angestellte sind oft bereits voll ausgelastet. Einer der Hauptgründe, wieso das Unternehmen überhaupt nach Optimierungen sucht und sich an Berater gewandt hat, ist es ja das Ihnen Kapazität fehlt. Sie finden nicht genügend Angestellte, um die bestehende Auftragslast zu bewältigen und versuchen deswegen mit der bestehenden Belegschaft mehr zu schaffen. \nDurch diesen Umstand fällt die Umsetzung in die Hände der IT-Berater, die damit dann wiederum zu IT-Dienstleistern werden. Hierdurch entstehen dann wiederum die bereits beschriebenen Probleme, die mit diesen zusammenhängen."
    },
    {
        "chapter_title": "KEINE IT",
        "chapter_content": "Keine IT ist auf lange Sicht gesehen ein Todesurteil für eine Firma. Dies liegt daran, dass ohne IT ein Unternehmen nicht in der Lage ist mehr zu leisten als durch die Angestellten umsetzbar ist. Entscheidet sich ein Konkurrent dazu in IT zu investieren, ermöglicht dies Ihm mehr Arbeitsleistung, besseren Service und ein gleichwertiges, wenn nicht besseres Produkt kostengünstiger anzubieten. Dadurch werden Kunden nach und nach abwandern."
    },
    {
        "chapter_title": "FERTIGSOFTWARE",
        "chapter_content": "Wie bereits in vorherigen Kapiteln erwähnt, bietet viele Fertigsoftware, für die meisten Unternehmen, kaum mehr als einen neuen Rahmen, in dem dieser zunächst versuchen muss, die bereits bestehenden Prozesse wieder abzubilden, bevor überhaupt eine messbare Verbesserung eintritt. \nIn vielen Fällen, sobald es um produktspezifische Prozesse geht, sind die Standardprogramme dazu nicht in der Lage diese abzubilden. Somit müssen auch Sie aufwendig angepasst werden und einer der versprochenen Vorteile von Standardsoftware, eben keine individuelle Programmierung zu brauchen, ist hinfällig. \nDiese Erkenntnis kann recht spät im Umstellungsprozess hervortreten und so einen Ausstieg kostenintensiv und mit vielen Verlorenen Investitionen bedeuten. Eine Entscheidung für eine solche Standardsoftware kann somit außerordentlich Betriebsschädigend sein. Von einer solchen Umstellung ist in vielen Fällen abzuraten da das Übertragen der Prozesse zu hohen Kosten, aber vor allem Zeitverlust führt. \nWar also die Auswahl der Software darauf bedingt individual Anpassung zu vermeiden, ist diese Absicht gescheitert und das Übertragen der Prozesse hatte keinen Mehrwert. \nBesonders schädlich bei der Einführung von Standardsoftware ist, dass sehr viel Zeit vergeht bis der Status Quo wiederhergestellt wird. Somit entsteht, für eine lange Zeit, möglicherweise Jahre, kein positiver Effekt für den Kunden.\nSelbst wenn den Angestellten, umsatzschädigend, Zeit für die Umsetzung eingeräumt wird, fehlen Ihnen zu Beginn viele der notwendigen Kenntnisse. Dies führt dazu das Sie zunächst kostenintensiv geschult werden müssen. Hierdurch wird noch mehr Zeit benötigt, was den ROI mindert. Durch die Schulungen kann dann wieder so viel Zeit in Anspruch genommen worden sein, dass dann keine Zeit mehr für die Umsetzung besteht. Ein Teufelskreislauf aus Schulungen, zu wenig Zeit, um neues Wissen einzusetzen, vergessen und erneute Schulungen entsteht. \nSelbst wenn die Angestellten Zeit haben, um Prozesse in die neue Software zu übertragen, bedeutet dies nicht, wie bereits erwähnt dass sie unbedingt in der Lage sind, alle der bereits bestehenden Prozesse abzubilden. Aus meiner eigenen Erfahrung wird nur ein Anteil der Prozesse in die neue Software übertragen. Es kann Jahre dauern, während mehrere Programme betrieben werden müssen, um den Prozess zu bearbeiten, bis ein Prozess vollständig in der neuen Software bearbeitet werden kann. Das führt zu zusätzlichen Kosten in Form von Schulungskosten, Rüstungskosten, das sind Ineffizienzen durch hin und her wechseln zwischen verschiedenen Programmen, und natürlich Kosten für das Betreiben der Software. \nWie erwähnt haben die meisten Unternehmen bestimmte Bereiche, die in Standardsoftware Lösungen nicht abgebildet werden können. Genau für diese Bereiche ist es dann notwendig individuelle Anpassung an der Software durchzuführen. Solche Anpassungen, wird sich dafür entschieden, sind besonders kostenintensiv und mindern die positiven Effekte, die von solchen Standardlösungen versprochen werden. Der hohe Preis hier kommt mitunter zustande, dass es für diese Anpassungen meist Spezialkenntnisse verlangt, über die nur sehr wenige Programmierer verfügen. Dieses Spezialwissen lassen sich die Entwickler dementsprechend hoch bezahlen, da es für Sie aufgrund der auch eher kleinen Auftragszahl notwendig ist, mehr mit den einzelnen Projekten umzusetzen.\nStandard Software Lösungen wie SAP verfügen über sehr viele Tools, um Prozesse zu digitalisieren. Wie beschrieben jedoch entstehen in dem Moment, in dem Prozesse auf die eigenen Bedürfnisse hin angepasst werden müssen, hohe zusätzliche Kosten. Unternehmen wie SAP versuchen dieses Problem zu lösen, indem Sie sogenannte Low Code oder No Code Lösungen anbieten, durch die Anwender in die Lage versetzt werden sollen, diese Anpassungen selbst durchzuführen. Leider bleibt das Hauptproblem, den bereits zuvor erwähnten Mangel an Zeit der Anwender, weiterhin bestehen. Auch kommt es wieder zu Schulungsbedarf, der nicht zum Hauptaufgabenbereich der Anwender gehört und so Expertise aufbaut, die für Ihren Hauptaufgabenbereich nicht gebraucht wird. \nProblematisch an dieser Art von Lösung ist auch, dass hierbei Endnutzer Zugriff auf Funktionalität erhalten, durch die viel Schaden entstehen kann. Ohne ein Überprüfen der aus Low Code bzw. No Code entstehenden Programme könnte es dazu kommen, dass versehentlich alle Daten gelöscht werden, und sollte es keine Backups geben, dies nicht rückgängig gemacht werden kann. Um diese Art von Problemen zu vermeiden ist trotz der zunächst einfach wirkenden Entwicklung ein recht hoher Schulungsbedarf wieder von Nöten.\n\nIm NADOO IT System hingegen wird neue Software in die bereits bestehenden Prozesse integriert oder Tools geschaffen, um diese miteinander zu verbinden. Es wird also nie der Status Quo beschädigt und muss dementsprechend auch nicht wieder erreicht werden. Ab dem ersten Moment des Digitalisierungsprozesses der NADOO IT Methode, wird ein Mehrwert generiert. Dies ist auch logisch da im NADOO IT System nur durch diese Mehrwert Generierung auch Einnahmen generiert werden. Ein Übertragungsprozess, der möglicherweise mehrere Jahre dauern kann, vom bestehenden System in ein neues, wie dies bei z.B. der Einführung von Programmen wie SAP nicht unüblich ist, wird wirtschaftlich unattraktiv. Während Hersteller wie SAP bereits im Übertragungsprozess Geld durch Lizenzgebühren, Beratergebühren usw. einnehmen, ist im NADOO System dies ausgeschlossen.\nIm NADOO IT System ist der Übergang von mehreren Tools zu einem Mastertool fließend und auch umkehrbar. \nIm Gegensatz zu Tools wie SAP zielt NADOO IT nicht darauf ab sogenannten „Vendor lock-in“ zu erreichen. Da im NADOO System grundsätzlich keine Software, sondern dessen Effekt verkauft wird, sind Daten im NADOO System darauf ausgelegt zwischen Programmen transferierbar zu sein. Im NADOO System „gewinnt“ immer die Software, welche am besten den bepreisten Effekt, der Zeitersparnis, erreicht. Hierzu zählt auch Software, die nicht vom NADOO System erstellt wurde. \nSolche externe Software wird entweder von dessen Hersteller in das NADOO System integriert oder durch eine NADOO Alternative, entwickelt von unseren Mitgliedern, ersetzt. Ein Wechsel von nicht NADOO Software zu NADOO Software ist hauptsächlich dann begründet, wenn die nicht NADOO Software zu wenig Möglichkeiten bietet auf die Kundenzwecke hin angepasst zu werden und somit auch nicht optimale Zeitersparnis ermöglicht. Weitere Gründe könnten aber auch sein, dass die Software sogenannte „Abandoned Software“ ist, die von seinem Hersteller nicht weiter gepflegt wird oder aber Sicherheitsrisiken durch diese entstehen und durch die Mitglieder von NADOO IT beseitigt werden wollen."
    },
    {
        "chapter_title": "WIE NADOO EINE SYMBIOSE MIT DEN BESTEHENDEN SYSTEMEN BILDEN KANN",
        "chapter_content": "Nachdem ich nun auf die bereits bekannten Strukturen von IT eingegangen bin, möchte ich in diesem Kapitel erläutern wieso NADOO sich mit diesen Systemen kombinieren lässt.\nAls Erstes ist wichtig, das im Gegensatz zu den meisten zuvor genannten Varianten der IT, im NADOO System dem Kunden immer aller Softwarecode offen vor liegt. Zu keinem Punkt besteht für den Kunden die Gefahr, dass er auf die Programme, die er verwendet, keinen Zugriff mehr hat. Eine Abhängigkeit zwischen NADOO oder einem spezifischen Entwickler wird dadurch verhindert. Er kann diese selbst weiter entwickeln und erweitern. Auch liegt die Software so vor, dass er diese selbst betreiben und nur wenn er dies möchte, diese Aufgabe an NADOO abgeben kann. \nDurch die Art wie die Software entwickelt wird, liegen alle Komponenten als kleine und gut zu überblickende Bausteine vor. Dadurch kann diese schnell von einem anderen Entwickler übernommen und weiterentwickelt werden.\nEin bereits bestehendes Entwicklerteam kann durch die Schnittstellen, die bei allen NADOO Programmen vorhanden sind, diese selbst ansteuern. Dank des Preismodells im NADOO System, ist dies auch wieder im gemeinsamen Interesse, da durch eine bessere Integration auch mehr Ausführungen resultieren und so auch mehr Umsätze.\n \nAuch die bereits beim Kunden verwendete Software, sollte diese die Möglichkeit bieten sich integrieren zu lassen, wird mit angebunden. Da der Kunde nicht für NADOO Software zahlt, sondern, wie jetzt bereits öfters erwähnt, für den Effekt, ist es im Interesse der Entwickler, möglichst viel Software wiederzuverwenden um die Zeit zwischen Entwicklung und Effekt so kurz wie möglich zu halten. Ist es also möglich durch NADOO Lösungen die bereits verwendete Software schneller anzusteuern, und dort Arbeitsprozesse zu beschleunigen, ist dies im Interesse von NADOO Entwicklern. Entwickler im NADOO System sind auch an sich deutlich weniger daran interessiert Datenverwaltungstools zu erstellen, da ein reines Verwalten keine Zeitersparnis bedeutet und somit keine Einnahmen. Es ist die Verarbeitung und die Verwendung dieser Daten, bei der eine Zeitersparnis entsteht. \nEs ist dennoch davon auszugehen, dass sich über die Dauer eigene Verwaltungstools im NADOO System etablieren werden. Diese werden entstehen, um neue Einsparungen zu ermöglichen oder für Kunden entwickelt werden, bei denen noch gar keine Lösung dafür existieren. Da diese Software aber keine oder wenn dann nur schwer messbare Zeitersparnis bedeutet, ist davon auszugehen, dass diese Software kostenlos für den Kunden sein wird. Die Finanzierung für diese Art von Software ist dank des NADOO IT Budget Systems ebenfalls im NADOO System realisierbar.\nWie also beschrieben werden schon etablierte Tools weiterverwendet und nur wenn dies zwingend notwendig oder von Kunden gewünscht ist durch NADOO Lösungen ersetzt bzw. erweitert.\nFür IT-Berater ist das NADOO System ebenfalls interessant, da Sie, wenn Sie bestimmte Arbeitsschritte durch existierende NADOO Lösungen, beschleunigen können, ebenfalls auf Dauer Einnahmen generieren. Somit sind Berater auch daran interessiert, so schnell es Ihnen möglich ist, Kunden zu digitalisieren und für eine Wiederverwendung der Software zu sorgen. Dadurch werden Anreize geschaffen Produkte zu entwickeln, die universal einsetzbar sind und sich schnell auf die Kundenbedürfnisse anpassen lassen. Es entsteht ein Vertriebsnetz zwischen Entwicklern und IT-Beratern.\n\nAuch IT-Dienstleister können im NADOO System von vielen Vorteilen profitieren. Sie können als bereits etablierte Organisationen für Softwarebausteine bzw. Dienste für deren Entwicklung auftreten und brauchen sich selbst weniger, um dessen Vertrieb zu kümmern.\nEs entsteht ein Netzwerk aus Beratern und Entwicklern, die Software bei Kunden realisieren und Dienstleistern, die die Kernsoftware warten."
    },
    {
        "chapter_title": "WAS IST NADOO MITARBEITER 2.0?",
        "chapter_content": "NADOO Mitarbeiter 2.0 ist ein Bonus-System für Kunden und deren Angestellte, das später im Rahmen von NADOO angeboten wird.\nDieses System soll die beratende Arbeit von Angestellten, die für die Entwicklung und Verbesserung der Software notwendig war und ist, belohnen.\nAngestellte und Anwender der Software erhalten einen Teil der durch ihre Verwendung erwirtschafteten Einnahmen. Hierbei ist wichtig, dass es sich nicht nur um eine Ausschüttung der Einnahmen aus dem eigenen Betrieb, bei dem der Angestellte selbst angestellt ist, handelt, sondern aus allen Betrieben, bei denen die Software eingesetzt wird.\nUm teilzunehmen, müssen Angestellte Mitglieder der NADOO Genossenschaft werden.\nIn den späteren Phasen von NADOO Mitarbeiter 2.0 wird den Mitgliedern dieses Bausteins es eröffnet Ihre überschüssige Arbeitsleistung auch bei anderen Arbeitgebern einzusetzen. Da in den nächsten 20 Jahren es Weltweit zu einem massiven Mangel an Fachkräften kommen wird, noch viel stärker als dies bereits der Fall ist, wird es eine hohe Nachfrage nach Ihren Fähigkeiten geben. Selbst mit den Automatisierungen, die im NADOO System erstellt werden, wird dieser Bedarf nicht zu decken sein. Gleichzeitig wenn aber im eigenen Betrieb die Menge der Arbeit nach den Automatisierungen nicht mehr ausreicht, um die Angestellten vollständig nach Ihren Wünschen auszulasten, können diese so zusätzliche Arbeiten, wenn diese dies wünschen, durch das Netzwerk erhalten.\nHierdurch wird wieder ein weiterer Sorgenpunkt, den Angestellte durch Automatisierung haben könnten, dass Ihr Arbeitsplatz wegfällt, abgemildert bzw. beseitigt werden."
    },
    {
        "chapter_title": "WAS IST DIE NADOO GENOSSENSCHAFT?",
        "chapter_content": "In den späteren Phasen von NADOO wird die NADOO Genossenschaft gegründet. \nDie NADOO Genossenschaft soll ein Demokratisches Element zum NADOO System hinzufügen. Diese steuert wofür sich das NADOO System einsetzt oder auch nicht. Durch die NADOO Genossenschaft wird die Machtstruktur so angepasst, dass alle Elemente von NADOO deren Mitgliedern dienlich ist. So wird sichergestellt, dass das NADOO System nicht in seinem eigenen, hautsächlich Algorithmisch basierten, oder im Interesse der Geschäftsführung von NADOO Genossenschaft handelt.\nWie die endgültige Struktur der NADOO Genossenschaft aussehen wird, ist noch zu erarbeiten. Das Hauptziel der Struktur der NADOO Genossenschaft muss aber sein, dass die Regulierenden Strukturen nicht in Ihrem eigenen Interesse handeln können und das die Verwaltenden Strukturen nicht endlos wachsen können.\nDer Hauptgrund für die Gründung der NADOO Genossenschaft basierte auf meinen Beobachtungen mächtiger Unternehmen wie Facebook, Microsoft, Google und Tesla. Diese wurden oft von Schlüsselfiguren geleitet und handelten gelegentlich gegen die Interessen der Menschheit. Um dieser Entwicklung entgegenzuwirken, entschied ich mich bewusst für eine Genossenschaft als Kernstruktur von NADOO, statt auf traditionelle Unternehmensformen zurückzugreifen. Meine Erfahrungen zeigten, dass solche Unternehmen durch bestehende Regierungsapparate nur langsam und unzureichend reguliert werden. Zudem entziehen sie sich oft der Verantwortung durch rechtliche Schlupflöcher. Mit der NADOO Genossenschaft wird das Risiko einer Übernahme durch Investoren oder eines „schlechten“ Geschäftsführers weitgehend minimiert."
    },
    {
        "chapter_title": "WAS IST DER NADOO KEY?",
        "chapter_content": "Während der letzten Jahre beobachtete ich einen gefährlichen Trend im Bereich der IT-Sicherheit. Auf der einen Seite begannen immer mehr weniger IT Versierte Personen mit dem Internet zu interagieren und auf der anderen wurden die Werkzeuge von Datendieben und Internet Kriminellen immer ausgefeilter. Ich war bereits kurz nach der Entstehung von Smartphones auf 2FA umgestiegen, was jetzt in vielen Unternehmen umgesetzt wird. Leider ist 2FA als Schutz vor den jetzt gängigen und in naher Zukunft immer schlimmer werdenden Phishingattaken unzureichend. Der NADOO KEY ist ein FIDO2 Sicherheitsschlüssel. Dank eines solchen Sicherheitsschlüssels ist man gegen Phishing und Man in The Middle Attacken geschützt. Um die Systeme von NADOO zu schützen und unsere Kunden vor solchen Angriffen zu bewahren ist NADOO nur mittels solcher Schlüssel zugänglich. Zumindest die ersten Kunden erhalten diese sogar kostenlos. Hat sich das System erst bewiesen, werden zukünftige Kunden auch bereit sein dafür zu bezahlen.\nDer NADOO Key kommt mit noch vielen weiteren Vorteilen. So kann vollständig auf Passwörter verzichtet werden, die durch Ihr vergessen derzeit einen Großteil der Arbeitszeit in IT-Abteilungen in Anspruch nehmen. Stattdessen können die Nutzer den Zugang zu Ihrem Onlinekonto auf dieselbe Art öffnen wie sie es von Ihrer Haustür gewohnt sind. \nAuch da jeder Nutzer über einen solchen Schlüssel verfügt und dieser nicht geteilt werden kann ist ein Schlüssel auch einem Nutzer bzw. einen Zugang zuordenbar. Dadurch entfällt die Notwendigkeit von personenbezogenen Daten, die bei anderen Diensten erforderlich sind. Es wird also weder E-Mail, Telefonnummer, Name oder sonst eine auf die Person zu rückverfolgbare Information benötigt.\nInsgesamt wird dadurch es möglich innerhalb von NADOO vollständig anonym als auch pseudonymisiert agieren zu können. Jedoch sollte innerhalb des Systems ein User auffällig werden, kann der Schlüssel gesperrt werden und der Zugang verwehrt werden. Der User hat keinen Weg, sich wieder selbst anzumelden ohne erhebliche kosten oder sich preiszugeben und Einspruch zu erheben.\nIm Rahmen unserer Bemühungen, die Erstellung mehrerer Konten zu unterbinden, werden wir im Verlauf der Entwicklung der Genossenschaft das Proof of Personhood-System einführen. Dieses Konzept wird aktuell durch World ID realisiert, das ein integraler Bestandteil der World App ist. Dadurch wird sichergestellt, dass jeder Nutzer eindeutig identifizierbar ist, ohne die Notwendigkeit persönlicher Daten wie E-Mail, Telefonnummer oder Name."
    },
    {
        "chapter_title": "WAS IST NADOO ID?",
        "chapter_content": "In den letzten Jahren fand ich mich zunehmend in Gesprächen über die wachsende Unsicherheit und das erodierende Vertrauen in Online-Identitäten wieder. Die Digitalisierung hat uns ein Meer von Möglichkeiten eröffnet - von grenzenloser Kommunikation bis zum globalen Online-Handel. Doch mit diesen Möglichkeiten sind auch ernsthafte Herausforderungen entstanden. Mit der Einführung von Deep Fakes und immer raffinierteren Betrugsmethoden wurde es fast unmöglich, echte Identitäten von gefälschten zu unterscheiden. Hier kommt NADOO ID ins Spiel.\nNADOO ID ist eine bahnbrechende Innovation, die sich dieser Herausforderungen annimmt. Es baut auf dem Fundament des NADOO KEY auf und führt uns in eine Ära der Online-Identifizierung, die gleichermaßen sicher und anonym ist. Es handelt sich dabei um ein System, das die Identifikation von Nutzern ermöglicht, ohne sich dabei auf sensible personenbezogene Daten verlassen zu müssen - keine E-Mails, Telefonnummern, Namen oder andere persönliche Informationen, die auf die Person zurückverfolgbar wären. \nDas Verfahren ist einfach, aber dennoch genial. Bei jeder Interaktion, jedem Handel, jedem Austausch kann ein Nutzer einen Identitätscheck anfordern. Dies erfolgt über einen Link, den der Inhaber des NADOO KEY zur Verfügung stellt. Der Nutzer kann den Prozess in Echtzeit verfolgen und erhält sofortige Bestätigung, wenn der Schlüssel aktiviert wird. \nNADOO ID ist ein robustes und sicheres System, das Missbrauch durch seine einzigartige Schlüsselzuordnung verhindert. Jeder Schlüssel ist einem Nutzer und damit einem Konto zugeordnet. Wird ein Nutzer innerhalb des Systems auffällig, kann sein Schlüssel gesperrt und ihm der Zugang verweigert werden. Ohne seinen eindeutigen Schlüssel kann sich der Benutzer nicht erneut anmelden. \nEin weiterer entscheidender Aspekt von NADOO ID ist die Fähigkeit, jede Nachricht mit einer digitalen Signatur zu versehen. Dadurch wird die Authentizität jeder einzelnen Nachricht sichergestellt. SPAM, Identitätsdiebstahl und viele der derzeit im Internet gängigen Probleme werden dadurch im NADOO Netzwerk beseitigt. \nNADOO ID ist mehr als nur eine Lösung zur Identifikation. Es ist ein Paradigmenwechsel in der Art und Weise, wie wir über Identität im digitalen Raum nachdenken. Mit NADOO ID haben wir einen Weg gefunden, die Sicherheit zu stärken, Vertrauen wieder aufzubauen und gleichzeitig Anonymität und Datenschutz zu gewährleisten, die uns in der digitalen Welt so wichtig sind. In Zukunft werden wir uns nicht mehr fragen müssen, ob wir unserem Gegenüber im Internet vertrauen können - denn wir können es, dank NADOO ID."
    },
    {
        "chapter_title": "WIE ENTSTEHT DER STUNDENPREIS?",
        "chapter_content": "Dieses Kapitel ist größtenteils eine Formelsammlung, die versucht die Berechnungsgrundlage für den Preis pro Stunde und den damit verbundenen Berechnungs-Algorithmus zu erläutern.\nDiese Formel wird sich über das Bestehen des NADOO Systems erweitern um mögliche bis jetzt unbekannte Probleme zu bekämpfen.\nZunächst ist wichtig zu verstehen, dass der Preis pro Stunde dynamisch ist. \nEs gibt keinen fixen Preis. \nEr wird über einen Algorithmus bestimmt, der als Ziel das kontinuierliche Wachstum von Return on Investment verfolgt. So kann es recht lange dauern, bis ein Investment in einen bestimmten Kunden sich wieder amortisiert hat.\nDurch den Algorithmus ist bestimmt, dass die Geschwindigkeit, mit der dieser Zeitpunkt erreicht wird, immer schneller zustande kommt.\nZum Zeitpunkt der Verfassung dieses Dokumentes beginnen alle Programme zunächst mit einem höheren Stundenpreis. Über den Zeitraum der Anwendung fällt, umso mehr Zeit erspart wurde, der Preis bis auf einen Basis Preis von 30€ pro Stunde.\nAb dem Erreichen dieses Basispreises wird der Preis entkoppelt und vom Algorithmus übernommen.\nDiese Startpreiskurve hat mehrere Gründe. \n1.\tEs soll Entwickler zusätzlich motivieren neue Software zu entwickeln, da diese zu Beginn auch bei niedrigen Ausführungen gute Einnahmen erwartbar macht.\n2.\tEs lässt den Kunden und Entwickler davon absehen noch unerprobte Prozesse und nicht Kernaufgaben vorrangig zu automatisieren.\n3.\tEs gibt neuen Entwicklern die Möglichkeit direkt zu Beginn schnell zusätzliches Einkommen zu generieren und so mehr Zeit für das NADOO System einzusetzen.\n4.\tBesonders am Anfang des Entwicklungsprozesses ist zu erwarten, dass es zu viel zusätzlicher Arbeit und nachträglichen Anpassungen kommt. Diese höheren Kosten werden durch den höheren Preis abgefangen. Hat das Programm das Ende der Kurve erreicht, befindet es sich im „Maintenance“ zu Deutsch Wartungsmodus.\n\nWenn Sie die Formel einsehen möchten, schauen Sie bitte in die Textversion dieses Buches."
    },
    {
        "chapter_title": "WIE ERWEITERT NADOO DIE WIRTSCHAFT?",
        "chapter_content": "Dieses Kapitel stellt eine starke Vereinfachung der gesamten Wirtschaft und derer Systeme, die Sie bildet, dar.\nZiel ist es zu verdeutlichen inwieweit NADOO, die bestehenden Systeme erweitert und wie, der Vertrag, der durch NADOO umgesetzt wird, einzuordnen ist. \nEs soll dabei helfen verständlich zu machen, wieso ich die Strukturen von NADOO, die in den vorherigen Kapiteln erläutert wurden, festgelegt habe. \nEs soll Verständnis schaffen für die Hintergründe der Regeln, die NADOO festlegt. Das diese nicht so gewählt wurden um „Zu gut, um wahr zu sein“, sondern um Gefahren von unerwünschten Zieloptimierungsprozessen, die bei jedem Vertrag entstehen können, zu verringern."
    },
    {
        "chapter_title": "WAS IST DIE WIRTSCHAFT?",
        "chapter_content": "Um die Wirtschaft bzw. wie die Wirtschaft an sich entsteht, ist es entscheidend mit einem Bereich der Philosophie vertraut zu sein. \nDie „Vertragstheorie“ oder auch „Kontraktualismus“ bzw. „Lehre vom Gesellschaftsvertrag“. Ein tiefes Verständnis ist hierbei nicht notwendig. \nEs ist lediglich wichtig zu verstehen, dass alles gesellschaftliches Handeln und damit die Basis für unsere Gesellschaft und die Wirtschaft auf Verträgen, egal ob explizite oder implizite Verträge, basiert. \nDie Vertragstheorie besagt, dass der Mensch an sich keine Regeln hat. Durch Verträge wird bestimmt wie zwischen den Menschen gehandelt wird. Verträge bestimmen Regeln aus denen geordnete Strukturen entstehen, in dessen der Mensch sich frei bewegen kann. Diese Verträge werden durch eine Instanz, die von der Gesellschaft die „Macht“ dazu erhält, umgesetzt und eingehalten. Dadurch entsteht Vertrauen und Vorhersehbarkeit, wodurch Sicherheit entsteht. Die Regeln schränken die Möglichen Entscheidungen so weit ein, dass es leichter ist Entscheidungen zu treffen.\nBeispiele für solche Verträge, mit denen wir alle vertraut sind, sind die bekannten Arbeitsverträge und Gesellschafterverträge.\nSo entstehen die derzeitigen Formen von Unternehmen, GmbH, UG, AG, usw., durch eine Kombination aus diesen Verträgen. Ein Gesellschaftervertrag klärt den Besitzanspruch an einem Unternehmen, während ein Arbeitsvertrag die Rechte zwischen den Arbeitern und Unternehmen regelt.\nSomit ist jeder dieser Verträge verantwortlich, für das Entstehen von den uns bekannten Gesellschaftsstrukturen. Jeder dieser Verträge beinhaltet bestimmte Regeln, in denen sich diese Gesellschaftsstrukturen frei bewegen können. Sie legen fest welche Freiheiten bestehen und auch, wohin sich diese optimieren.\nDer durch NADOO umgesetzte Vertrag, ist ein weiterer solcher Vertrag. NADOO stellt dabei das erste Unternehmen dar, welches nach diesem neuen Vertrag gestaltet ist und repräsentiert damit den Beginn eines neuen Marktsegmentes. \nWie erwähnt benötigt jeder Typ von Vertrag auch eine durchführende Struktur. Diese ist die NADOO IT Plattform. Durch Sie werden die im Vertrag festgelegten Regeln ermöglicht und durchgesetzt. Er erweitert somit die Möglichkeiten der Gesellschaftsstrukturen und schafft eine neue Basis von vertraglich basiertem Vertrauen. \nGenau durch diesen Umstand werden die zuvor erklärten Strukturen ermöglicht. Es ist sehr wahrscheinlich das es noch viele weitere, selbst mir als dem Erfinder dieses neuen Vertrages, unbekannte Strukturen geben wird."
    },
    {
        "chapter_title": "WIESO EIN PREIS PRO STUNDE?",
        "chapter_content": "Um verständlich zu machen, wieso im NADOO System ein Preis pro Stunde eingesetzt wird und was für Auswirkungen dies hat, ist zunächst es notwendig sich über eine, für alle Systeme zutreffende, Eigenschaft von Systemen bewusst zu sein.\nIn jedem System gibt es etwas, dass die Utility Funktion genannt wird. Eine Utility Funktion ist die Methode nach der sich ein System entwickelt bzw. wie es sich optimiert. Diese Utility Funktion entwickelt sich immer so, dass es das Maximum dessen erzeugt, woran ein System bemessen bzw. bepreist wird.\nUm das Prinzip der Utility Funktion zu verdeutlichen hier ein Beispiel aus der Softwareentwicklung. \nIn der Softwareentwicklung, im Bereich der Qualität Sicherung, gibt es so bei manchen Unternehmen die Metrik der Testabdeckung. Das bedeutet, dass gemessen wird wie viele der Zeilen des Codes von einem Test, der dessen Funktionalität überprüfen soll, erfasst wird. \nDies führt dazu, dass mehr und mehr Test geschrieben werden, um schlussendlich so nahe wie möglich an 100% Testabdeckung zu kommen. Dadurch soll erreicht werden, dass die Software sicher und frei von Fehlern ist. Diese Metrik jedoch garantiert nicht sichere Software, wie mir Experten aus dem Bereich beigebracht haben. Denn nur weil 100% des Programm Codes von Tests erfasst werden, bedeutet dies nicht, dass der Code fehlerfrei ist. Es bedeutet lediglich, dass die Szenarien, die getestet werden, ohne Fehler sein können. Es werden nicht unbedingt alle möglichen Variationen getestet die aufkommen können.\nDieses Beispiel verdeutlicht, dass eine Metrik nicht gleichbedeutend ist mit dem tatsächlichen Erreichen des Zieles, welches von dessen Entscheider gewünscht wurde, im gegebenen Fall, einer sicheren Software.\nEs ist also für ein System entscheidend, das die Metrik, anhand derer Sie bemessen wird, so nahe wie nur möglich am gewünschten Ziel angelehnt ist. \nIm NADOO System wurde deswegen der Preis auf ersparte Zeit gesetzt. Dadurch, dass ersparte Stunden bepreist werden und somit die daraus resultierende Produktivitätssteigerung, entwickelt sich das System hingegen dahingegen maximale Produktivitätssteigerung zu erzeugen. Dinge, die nicht diesem Ziel beitragen haben im System keinen Wert, da diese nicht bemessen werden. \nDies bedeutet dennoch, dass auch Tools, Funktionalität und Methoden entwickelt werden, die keine direkt messbare Produktivitätssteigerung bedeuten. Dies entsteht daraus, dass bestimmte Tools und Funktionalität notwendig sind, um weitere Produktivitätssteigerung zu ermöglichen. Das fehlende Bepreisen dieser führt nur dazu, dass das Investment in solche Tools limitiert ist und sollte der Produktivitätssteigerungseffekt nicht eintreten, diese verschwinden. \nUm diese Art von Aufgaben explizit zu fördern, wurde das NADOO IT Budget System von mir entwickelt. Wichtig war es, dass die Quelle dieses Budgets zurückzuführen ist auf die erreichte Produktivitätssteigerung.\nFalls das Konzept der Utility Funktion bis hier hin noch unklar sein sollte, könnte möglicherweise noch ein weiteres Beispiel helfen, das uns allen bekannt sein sollte.\nAls passende Beispiele eigenen sich hier Brettspiele. Praktisch alle Brettspiele verfügen über ein Siegpunktesystem. Das jeweilige Spiel definiert hierbei, wie diese Punkte erhalten werden können, durch die Regeln des Spieles. Alle Spieler werden dann versuchen anhand der Regeln Strategien zu entwickeln, die dazu führen maximal Punkte zu erhalten. Ist ein Spiel hierbei wenig auf Kooperation bzw. Interaktion zwischen den Spielern ausgelegt, werden alle Spieler nach und nach verschiedene Strategien ausprobieren bis Sie die „optimale“ Strategie gefunden haben. Diese optimale Strategie äußert sich dadurch, dass Sie immer zu den maximal möglichen Punkten führt. Ist die Strategie gefunden, wird Sie von allen anderen Spielern kopiert werden. Schlussendlich führt dies dazu, dass die Eine Eigenschaft, durch die sich die Spieler voneinander unterscheiden, bestimmt, wer gewinnt. \nSpieleentwickler, um diese Optimierung zu verhindern bzw. zu begrenzen, und so ein „Solved Game“, also ein Spiel das gelöst ist und somit dazu führt, dass immer eine gleiche Schrittfolge abgearbeitet wird, zu vermeiden, werden in den meisten Spielen Elemente von Glück wie z.B. Karten ziehen, Würfeln oder der gleiches mit eingebaut. Dadurch sind die Spieler immer gezwungen auf die zufällig entstandene Situation zu reagieren. Es mag sein das es generelle eine gut funktionierende Taktik gibt, jedoch durch das Element Glück bleibt das Spiel immer „frisch“. Die Utility Funktion bleibt so flexibel und kann sich von Spiel zu Spiel ändern.\nDie wichtige Erkenntnis hierbei ist jedoch das die Bemessungsgrundlage, wodurch festgelegt wird was Sieg bedeutet, jedoch gleichbleibt. Bei jedem Mal, wenn das Spiel gespielt wird, wird wieder die Utility Funktion sich dahingegen optimieren die maximale Siegpunktzahl zu erwirtschaften.\nIm NADOO System ist hierbei die Spielregel, dass nur für ersparte Zeit gezahlt wird und somit wird die Utility Funktion sich immer dahingegen optimieren mehr Zeit zu ersparen. Um sicherzustellen, dass es hierbei zu keinen Methodiken bzw. „Tricks“ kommt, um künstlich Zeitersparnis und somit Siegpunkte zu generieren, werden weitere Spielregeln bestimmt. Eine der Hauptaufgaben von NADOO ist es diese Regeln ständig zu überprüfen und dafür Sorge zu tragen, dass tatsächlich Produktivitätssteigerung stattfindet. Sollten sich neue Taktiken entwickeln, die dieses Ziel umgehen, werden weitere Regeln eingeführt werden."
    },
    {
        "chapter_title": "WAS IST DER EFFEKT DES NADOO SYSTEMS?",
        "chapter_content": "Nachdem nun hoffentlich verdeutlicht wurde, was eine Utility Funktion ist, möchte ich auf einen besonderen Effekt, der durch die im NADOO System gewählte Metrik entsteht, eingehen.\nEs ist mir wichtig das zu verstehen ist, dass die folgende Beschreibung einen sehr langen Zeithorizont voraussetzt und dass es für jemanden, der zum ersten Mal sich mit diesem Thema auseinandersetzt Superlativ klingen kann. \nDurch diese neue Form der Bepreisung entsteht eine, für die Wirtschaft entscheidende, Veränderung. \nDurch die Bepreisung der Zeitersparnis entsteht eine limitierte Ressource der Wirtschaft, die zum ersten Mal erschlossen werden kann. \nDiese Ressourcen waren zuvor nur indirekt erschließbar.\nDiese Ressource ist Zeit und damit Produktivität.\nDiese Ressource ist besonders, da sie nicht künstlich geschaffen werden kann. Während Zentralbanken mehr und mehr Geld drucken können, ist Zeit, die gespart werden kann, durch tatsächliche Arbeit und damit Lebenszeit limitiert. \nDa es für diese Ressource eine Limitation gibt, entsteht über die Zeit eine Steigerung dessen Wertes. Wir sehen dies bereits jetzt durch den Fachkräftemangel, bei dem Fachkraft immer höhere Löhne verlangen können, da Ihre Zeit knapp ist.\nEine Bepreisung der Zeit führt somit dazu, dass die Zeit jedes einzelnen Menschen, durch die Steigerung seiner Produktivität, in Zukunft, ein Vielfaches dessen, des jetzigen monetären Werts, sein wird. \nDas durch NADOO geschaffene System wird, da die Ressource Zeit knapp ist, sich immer weiter dahingehend optimieren, dass auch die Zeit von Menschen, die jetzt durch mangelnde Bildung oder sonstige Umstände „gering“ ist, erschlossen wird und in seinem Wert steigt.\nEine deutliche Vertiefung dieses Effektes wird in zukünftigen Versionen dieses Dokuments erörtert werden. Es war mir lediglich wichtig die Idee des Effektes zu äußern und Sie als Leser dahingegen zu sensibilisieren."
    },
    {
        "chapter_title": "WAS SIND MÖGLICHE BEDENKEN NADOO ZU VERWENDEN?",
        "chapter_content": "Kunde: \"Naja, bei Microtransaktionen muss ich ja immer weiter zahlen. Wenn ich es selbst mache, habe ich das ROI für mich.\"\nNADOO: \" Das mag stimmen, aber man investiert seine Zeit in eine Aufgabe, die auch jemand anderes lösen könnte, während man sie stattdessen für Probleme verwenden könnte, die nur man selbst lösen kann. Zweitens ist es möglich, beides zu tun: Selbst an einem Problem arbeiten und gleichzeitig jemand anderen ein anderes Problem lösen lassen. Drittens birgt das eigene Programmieren das Risiko, dass es nie zu einem Return on Investment (ROI) kommt. Beauftragt man jedoch jemand anderen mit der Programmierung, besteht dieses Risiko nicht, und man profitiert dennoch von den Vorteilen. Diese Vorteile sind beim Selbstprogrammieren nicht garantiert, im Gegensatz zu einem Entwickler, der nach den NADOOIT-Standards arbeitet, da hier nur für erzielte Vorteile bezahlt wird. Viertens ist man beim Selbstprogrammieren durch das eigene Wissen begrenzt und muss eventuell komplett neue Technologien erlernen, was viel Zeit in Anspruch nehmen und so den ROI verringern kann. Fünftens werden selbst programmierte Anwendungen meist nur intern genutzt. Programme im NADOOIT-System können einem breiteren Markt von anderen Kunden zur Verfügung gestellt werden. Dies generiert Einnahmen, von denen ein Teil wieder an den ursprünglichen Kunden zurückfließt. So kann ein für einen selbst entwickeltes Programm einen deutlich höheren Gesamt-ROI erzeugen, als es innerhalb des eigenen Unternehmens möglich wäre. Entdeckt man ein 'virales' Programm, kann dies im Netzwerk mehr Einnahmen generieren als die Gesamteinnahmen des eigenen Unternehmens.\""
    },
    {
        "chapter_title": "Die Mikrotransaktionen müssen fortlaufend gezahlt werden. Wenn die Entwicklung selbst gemacht wird, kann der komplette ROI behalten werden.",
        "chapter_content": "Das mag stimmen, aber man investiert seine Zeit in eine Aufgabe, die auch jemand anderes lösen könnte, während man sie stattdessen für Probleme verwenden könnte, die nur man selbst lösen kann. Zweitens ist es möglich, beides zu tun: Selbst an einem Problem arbeiten und gleichzeitig jemand anderen ein anderes Problem lösen lassen. Drittens birgt das eigene Programmieren das Risiko, dass es nie zu einem Return on Investment (ROI) kommt. Beauftragt man jedoch jemand anderen mit der Programmierung, besteht dieses Risiko nicht, und man profitiert dennoch von den Vorteilen. Diese Vorteile sind beim Selbstprogrammieren nicht garantiert, im Gegensatz zu einem Entwickler, der nach den NADOOIT-Standards arbeitet, da hier nur für erzielte Vorteile bezahlt wird. Viertens ist man beim Selbstprogrammieren durch das eigene Wissen begrenzt und muss eventuell komplett neue Technologien erlernen, was viel Zeit in Anspruch nehmen und so den ROI verringern kann. Fünftens werden selbst programmierte Anwendungen meist nur intern genutzt. Programme im NADOOIT-System können einem breiteren Markt von anderen Kunden zur Verfügung gestellt werden. Dies generiert Einnahmen, von denen ein Teil wieder an den ursprünglichen Kunden zurückfließt. So kann ein für einen selbst entwickeltes Programm einen deutlich höheren Gesamt-ROI erzeugen, als es innerhalb des eigenen Unternehmens möglich wäre. Entdeckt man ein 'virales' Programm, kann dies im Netzwerk mehr Einnahmen generieren als die Gesamteinnahmen des eigenen Unternehmens."
    }
]